{
    "140": {
        "id": 140,
        "title": "TBD",
        "description": "TBD",
        "language": "English"
    },
    "139": {
        "id": 139,
        "title": "Feedback, Prizes & Giveaways",
      "description": "Wait for it because it's worth it",
      "image": "/images/backgrounds/opening.jpg"
    },
    "138": {
        "id": 138,
        "title": "Conference closing and final group photo",
        "description": "Make sure you won't miss closing ceremony. After the gifts, the group photo is what stays to remember in the future!",
        "image": "/images/backgrounds/closing.jpg"
    },
    "137": {
        "id": 137,
        "title": "Afterparty & Networking",
        "description": "Afterparty is a great time to have some fun and meet new people",
        "image": "/images/backgrounds/party.jpg"
    },
    "136": {
        "id": 136,
        "title": "GDG DevFest Porto 2016 - Welcome talk",
        "description": "Official start of the conference. Greetings from the organizers, sponsors and partners.",
        "language": "Portuguese",
        "image": "/images/backgrounds/opening.jpg"
    },
    "135": {
        "id": 135,
        "title": "Morning coffee",
        "description": "Coffeeeeeee!",
        "image": "/images/backgrounds/morning.jpg"
    },
    "134": {
        "id": 134,
        "title": "Coffee break",
        "description": "Coffeeeeeee!",
        "image": "/images/backgrounds/coffee-break.jpg"
    },
    "133": {
        "id": 133,
        "title": "Lunch",
        "description": "Foooooooood!",
        "image": "/images/backgrounds/lunch.jpg"
    },
    "132": {
        "id": 132,
        "title": "Registration",
        "description": "Get your badge, enjoy talking with tech edicts around",
        "image": "/images/backgrounds/registration.jpg"
    },
    "112": {
        "id": 112,
        "title": "",
        "description": "",
        "speakers": [
            10
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
            "Web"
        ]
    },
    "111": {
        "id": 111,
        "title": "",
        "description": "",
        "speakers": [
            10
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
            "Android"
        ]
    },
    "110": {
        "id": 110,
        "title": "Elastic Deployment",
        "description": "Or how to use Google Cloud Platform for peace of mind",
        "speakers": [
            9
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
          "Cloud",
          "Google Cloud Platform"
        ]
    },
    "109": {
        "id": 109,
        "title": "Ustwo's Android strategy for CI and Firebase testing.",
        "description": "Use continuous integration in your Android project to apply tests in physical devices with one single commit.",
        "speakers": [
            8
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
          "Android",
          "Firebase",
          "Testing"
        ]
    },
    "108": {
        "id": 108,
        "title": "Instant loading and great User Experience with PWA & AMP",
        "description": "Jumia Travel is the travel division of Jumia group, the African largest e-commerce website. As the African market is characterised by slow networks, performance has been one of the main priority of Jumia Travel to improve conversion.\nBy combining Polymer and PWA technologies, Jumia Travel has been able to reduce the Avg. page load time of 60% on slow networks, reduce data usage by 30% and deliver an app-like experience to their users. Jumia Travel also managed to lower the first page load time, typical pain point of Progressive Web Apps, by using AMP landing pages that asynchronously side-load the PWA.",
        "speakers": [
            7
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
            "Web"
        ]
    },
    "107": {
        "id": 107,
        "title": "Realm or: How I learned to stop worrying and love my app database",
        "description": "Using sql in mobile apps suck... is not nice. It makes us generate tons of boilerplate and it's slow to develop. We will talk about Realm, a new database engine (not an ORM!) for mobile that helps us to speed up our development process and suits better for mobile needs, I've been using almost from first release and I never came back to SQL. I will not only explain how it works, but also how I use it and how to avoid some common pitfalls when you start with Realm.",
        "speakers": [
            6
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
            "Realm",
          "Android"
        ]
    },
    "106": {
        "id": 106,
        "title": "Dive deep into machine learning with TensorFlow",
        "description": "Dive deep into machine learning with TensorFlow is a high-level introduction to the TensorFlow library, architecture and API. Originally developed at Google for the purposes of conducting machine-learning and deep neural networks research, TensorFlow leverages a general computational model that is applicable in a wide variety of other domains, especially for performing large-scale numerical computations on large data. This talk explains you how to use the library to train machine-learning models and make your next application smarter.",
        "speakers": [
            5
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
          "Cloud",
          "TensorFlow",
          "Machine Learning"
        ]
    },
    "105": {
        "id": 105,
        "title": "Typescript 101",
        "description": "The purpose of this talk is to provide an introduction to typescript. Initially this talk was about “functional typescript” but most folks showing really wanted to know more about typescript, not the functional aspect of it. So this talk aims at giving an introduction to the syntax, and how you can incrementally transform your coding style from pure javascript to typescript. \nIn the end you’ll take home how to setup a typescript build pipeline, how these interact with react and blueprint, we will look at the transpilation and how code and structure a typescript project (including good practices and linting).",
        "speakers": [
            4
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
          "Typescript",
          "Web",
          "React",
          "Blueprint"
        ]
    },
    "104": {
        "id": 104,
        "title": "Android Auto: driving the future",
        "description": "Google, Insurance Tech and Telematics. Add i2S to the mix and you'll be surprised!",
        "speakers": [
            2,3
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
          "Android Auto",
          "Android"
        ]
    },
    "103": {
        "id": 103,
        "title": "To be announced",
        "description": "Available soon",
        "speakers": [
            10
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
            "Android"
        ]
    },
    "102": {
        "id": 102,
        "title": "TensorFlow Codelab",
        "description": "Have you ever used TensorFlow? If not, you should try it... Mário Cordeiro will be giving this workshop to follow you through a TensorFlow Codelab where you can see Machine Learning working on your laptop. After this you have everything you need to go home and start playing with it. - You can bring Docker already installed to spare some time.",
        "speakers": [
            5
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
          "TensorFlow",
          "Cloud",
          "Machine Learning"
        ]
    },
    "170": {
        "id": 170,
        "title": "It's the Arts! Playing with android canvas",
        "description": "Many Android developers do not know the Canvas object or how to use the painting process. We will discuss about this process and see how to perform effects and views using the Canvas with some practical examples. Good knowledge of the Canvas and the drawing techniques could help us to do better applications and views with some spectacular effects in a few lines. (We will also vandalise some art in the workshop, just for the fun)",
        "speakers": [
            6
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
            "Android",
          "Canvas"
        ]
    },
    "101": {
        "id": 101,
        "title": "My Minecraft-Smart-Home: Prototyping the Internet of Uncanny",
        "description": "Software solutions and everyday objects are becoming increasingly \"smarter\", take over more \"responsibility\" and know more and more about us and our intentions. But what does that mean for developers, and what impact does this have on the user? How do we convey the understanding and competence for this Internet of Things? Sascha Wolter covers typical IoT challenges and inspires with crazy and sometimes creepy examples. He also introduces a prototypic approach for hardware and software ideation based on visual programming languages, games like Minecraft, and several IDEs. Of course, it is shown that this pragmatic approach is also suitable for professional projects using IoT platforms and smart home solutions such as Google Weave, Eddystone Beacons, Eclipse SmartHome, or openHAB.",
        "speakers": [
            1
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
            "IoT"
        ]
    }
}
