{
    "140": {
        "id": 140,
        "title": "TBD",
        "description": "TBD",
        "language": "English"
    },
    "139": {
        "id": 139,
        "title": "Keynote",
        "description": "",
        "language": "English"
    },
    "138": {
        "id": 138,
        "title": "Conference closing and contest winners announcements",
        "description": "Make sure you won't miss closing ceremony, all gifts from out sponsors and partners will find their owners during this session.",
        "image": "/images/backgrounds/closing.jpg"
    },
    "137": {
        "id": 137,
        "title": "Afterparty & Networking",
        "description": "Afterparty is a great time to have some fun and meet new people",
        "image": "/images/backgrounds/party.jpg"
    },
    "136": {
        "id": 136,
        "title": "GDG DevFest Porto 2016 - Welcome talk",
        "description": "Official start of the conference. Greetings from the organizers, sponsors and partners.",
        "language": "Portuguese",
        "image": "/images/backgrounds/opening.jpg"
    },
    "135": {
        "id": 135,
        "title": "Morning coffee",
        "description": "Coffeeeeeee!",
        "image": "/images/backgrounds/morning.jpg"
    },
    "134": {
        "id": 134,
        "title": "Coffee break",
        "description": "Coffeeeeeee!",
        "image": "/images/backgrounds/coffee-break.jpg"
    },
    "133": {
        "id": 133,
        "title": "Lunch",
        "description": "Foooooooood!",
        "image": "/images/backgrounds/lunch.jpg"
    },
    "132": {
        "id": 132,
        "title": "Registration",
        "description": "Get your badge, enjoy talking with tech edicts around",
        "image": "/images/backgrounds/registration.jpg"
    },
    "112": {
        "id": 112,
        "title": "Building web apps in 2016",
        "description": "Last year brought a lot of new capabilities to browsers, fundamentally changing the way we will build web apps in 2016. 60FPS, push messages, offline support and background sync became a reality marking the birth of Progressive Web Apps.",
        "speakers": [
            9
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
            "Web"
        ]
    },
    "111": {
        "id": 111,
        "title": "Dagger 2: dependency Injection Android way",
        "description": "It's beauty, it's handy, it's fast, it's easy - all about Dagger 2",
        "speakers": [
            9
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
            "Android"
        ]
    },
    "110": {
        "id": 110,
        "title": "The ultimate guide to MVP pattern on Android",
        "description": "There's a lot of hype around MVP pattern in the Android world. Now it's time for concretes. During his presentation Mateusz will tell you how IG divided responsibilities between pattern's different components, how they tied Presenters' and Views' lifecycles and what they did to make it all testable. If you'd love to make your Fragments' and Activities' code simpler and increase your coverage, but you're confused how to glue it all together - don't miss Mateusz's talk.",
        "speakers": [
            9
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
            "Android"
        ]
    },
    "109": {
        "id": 109,
        "title": "How much money Firebase can save you",
        "description": "TBD",
        "speakers": [
            9
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
            "Cloud"
        ]
    },
    "108": {
        "id": 108,
        "title": "New Data Architecture in Angular 2",
        "description": "Angular 2 introduces a new Data Architecture based on Reactive Programming using RxJS 5. We are really excited to see the new approach using Observable sequences aka Observables. We will cover a basic introduction of Angular 2 followed by RxJS 5 and the new HTTP API covering some basic use cases.",
        "speakers": [
            9
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
            "Web"
        ]
    },
    "107": {
        "id": 107,
        "title": "Introduction to Progressive Web Apps in Angular 2",
        "description": "There's been much discussion about Progressive Web Apps. They're still a relatively new model. In this talk, I'll summarise few options and techniques for getting started with your own Progressive Web App",
        "speakers": [
            9
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
            "Web"
        ]
    },
    "106": {
        "id": 106,
        "title": "Fuelio. Success story",
        "description": "Fuelio. Success story (I'll write more info later)",
        "speakers": [
            9
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
            "Android"
        ]
    },
    "105": {
        "id": 105,
        "title": "Typescript 101",
        "description": "The purpose of this talk is to provide an introduction to typescript. Initially this talk was about “functional typescript” but most folks showing really wanted to know more about typescript, not the functional aspect of it. So this talk aims at giving an introduction to the syntax, and how you can incrementally transform your coding style from pure javascript to typescript. \nIn the end you’ll take home how to setup a typescript build pipeline, how these interact with react and blueprint, we will look at the transpilation and how code and structure a typescript project (including good practices and linting).",
        "speakers": [
            4
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
          "Typescript",
          "React",
          "Blueprint"
        ]
    },
    "104": {
        "id": 104,
        "title": "Android Auto: driving the future",
        "description": "Google, Insurance Tech and Telematics. Add i2S to the mix and you'll be surprised!",
        "speakers": [
            2,3
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
          "Android Auto",
          "Android"
        ]
    },
    "103": {
        "id": 103,
        "title": "To be announced",
        "description": "Available soon",
        "speakers": [
            9
        ],
        "language": "English",
        "complexity": "Intermediate",
        "tags": [
            "Android"
        ]
    },
    "102": {
        "id": 102,
        "title": "Workshop - To be announced",
        "description": "Available soon",
        "speakers": [
            9
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
            "Cloud"
        ]
    },
    "101": {
        "id": 101,
        "title": "My Minecraft-Smart-Home: Prototyping the Internet of Uncanny",
        "description": "Software solutions and everyday objects are becoming increasingly \"smarter\", take over more \"responsibility\" and know more and more about us and our intentions. But what does that mean for developers, and what impact does this have on the user? How do we convey the understanding and competence for this Internet of Things? Sascha Wolter covers typical IoT challenges and inspires with crazy and sometimes creepy examples. He also introduces a prototypic approach for hardware and software ideation based on visual programming languages, games like Minecraft, and several IDEs. Of course, it is shown that this pragmatic approach is also suitable for professional projects using IoT platforms and smart home solutions such as Google Weave, Eddystone Beacons, Eclipse SmartHome, or openHAB.",
        "speakers": [
            1
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
            "IoT"
        ]
    }
}
