{
  "blog" : {
    "c4p" : {
      "backgroundColor" : "#3647a5",
      "brief" : "GDG DevFest Ukraine was announced, for the sixth year in a row, the conference will bring together 900 developers, managers and...",
      "content" : "GDG DevFest Ukraine was announced, for the sixth year in a row, the conference will bring together 900 developers, managers and entrepreneurs on **October 13-14** to Lviv.  This year our team is doing big advancement in the content, we're building an extra stage to accommodate more visitors and provide three fully independent tracks on Android, Web and Google Cloud topics.  Our focus is the content. **We’re looking for speakers like you**, who are ready to rock the stage and deliver the best talk or workshop in the field.  \"I've been to conferences all over the world and what you've created in Lviv is world class. It's easily first league of conferences.\" - Piotr Tuszynski, DevFest '16 Keynote Speaker  <div layout horizontal center-justified> <a href=\"http://bit.ly/df17-c4p\" rel=\"noopener noreferrer\">   <paper-button primary>Submit a proposal</paper-button> </a> </div>  ## Why is it cool to speak at the DevFest?  DevFest Ukraine is not an ordinary tech conference, besides selecting only the best speakers, we help them to succeed in delivering an exceptional quality talk on the stage.  Here are few perks that all our speakers get:  - **Expences covered**. Hotel for 3 nights, travel costs and entrance to exclusive speaker parties are covered for all speakers. - **Professional video recording**. We work with experienced video production companies to create session recording of the best quality. Stage, screen, audio, all is recorded separately and combined later. Check the [session videos from the last year](https://www.youtube.com/watch?v=VOwUnBkqmo4). - **Exposure**. By being a speaker, you are proving your level of expertise to a potential business partners or employers. Your talk will be promoted in our online resources and recording published in YouTube channel with more than 35k views. - **Unique networking**. Being a speaker means you’ll have the unique chance to network with other speakers - the best experts in the industry. - **Coaching**. We're in the same boat, after being selected as a speaker our program committee will help you to deliver the best talk possible. We provide information about the audience, presentation templates, feedback on the slides, all to help you to prepare.  \"It was a best DevFest I ever attended. So professional, so much enthusiasm from the community. You managed to bring the vibe of Google I/O to Ukraine.\" - David Vávra, DevFest '16 Speaker  ## What are we looking for?  We're looking for **experience-based talks**, the information that can not be found in the documentation or easily googled. We're looking for your stories, your struggles, research results and experiences with the frontier tools or technologies. Check the [list of topics](https://docs.google.com/document/d/18eGvBr6wdlXsfiZM4EK6SubfL3G1RWj-ABTBN9pngNg/edit?usp=sharing) we're interested in (it is not full and updated all the time).  ### Format  You can submit as many talks as you want. This year we accept submissions in two formats:   - 40 minutes sessions.   - 2(or 3) hours workshops.  ### Talks that will not pass initial review  - Talks about a specific tool/library/project explaining how it works or how to use it.  - Talks whose focus is pitching a company or project. It’s cool that you mention your company during the presentation, but it shouldn’t be the focus of the talk.  - Proposals that are not in English.  - Recruitment talks to attract talent.  We strongly recommend you check out [speaking.io](http://speaking.io/) website from Zach Holman. It includes good tips and guidelines for speakers.   ## Timeline  **Call for Papers submission deadline is July 1, 2017.** Submission results will be announced by July 16.   Any questions? Email organizers at [devfest@gdg.org.ua](mailto:devfest@gdg.org.ua)  <div layout horizontal center-justified> <a href=\"http://bit.ly/df17-c4p\" rel=\"noopener noreferrer\">   <paper-button primary>Submit a proposal</paper-button> </a> </div>",
      "image" : "/images/posts/c4p.jpg",
      "published" : "2017-02-12",
      "source" : "/data/posts/2017-02-12-c4p.md",
      "title" : "We're looking for speakers"
    },
    "dfua-summary" : {
      "backgroundColor" : "#ffc107",
      "brief" : "GDG DevFest Ukraine 2016",
      "content" : " [****DevFest Ukraine****](https://devfest.gdg.org.ua/) - it was fun, advantageous, crowded and exciting event! The scale of DevFest is simply breathtaking - 2 days full of Android, Web and Cloud hardcore!   The 5th annual conference GDG DevFest Ukraine - the biggest one related to Google techlogies in CEE - was held on September 9-10, 2016 in Lviv, Ukraine. The conference was powered by [Google Developers Group Lviv](http://lviv.gdg.org.ua/) (GDG Lviv) in together with the Google Developer Groups from all over Ukraine.   Some terrific facts about DevFest: ----------------------------------  - almost **700 attendees** - great open-minded people, full of  passion and great ideas  - incredibly high concentration of [Google Developer Experts](https://developers.google.com/experts/) in one place - **12** top-notch professionals  - **33 speakers** - well experienced, armed with knowledges and obsessed with Google technologies from all over the world  (UK, Israel, Germany, USA, Poland, Ukraine, Czech Republic, Switzerland, Romania, Turkey, Russia)  - **14** participating **GDG Groups**’ representatives (GDG Krakow, GDG Cherkasy, GDG Basel, GDG Prague, GDG Dnipro, GDG Kyiv-Center, GDG Istanbul, GDG Lviv, GDG Odessa, GDG Ternopil, GDG Uzhhorod, GDG KPI, GDG Kremenchuk, GDG Khmelnytskyi)  - **16** participating countries (UK, Israel, Germany, USA, Poland, Ukraine, Czech Republic, Switzerland, Romania, Turkey, Russia, The Netherlands, Belarus, Finland, Kazakhstan, Côte d’Ivoire)  - lots of sessions were full of deep knowledge and inspiration. Only technical stuff, only hardcore! Android sessions as always overcrowded.  <plastic-image srcset=\"/images/posts/summary16_2.jpg\" lazy-load preload fade></plastic-image>  - Progressive Web Apps (PWA) theme was the most popular on Web track, moreover, people could try it in practice on 2 workshops, hold by [Martin Splitt](http://localhost:4040/speakers/41/) and [Jakub Škvára](http://localhost:4040/speakers/18/).  <plastic-image srcset=\"/images/posts/summary16_3.jpg\" lazy-load preload fade></plastic-image>  - amazing demo zones were around (AR-music, DIY cardboards, Tilt Brush....)  <plastic-image srcset=\"/images/posts/summary16_4.jpg\" lazy-load preload fade></plastic-image>  - especially Emotobooth  <plastic-image srcset=\"/images/posts/summary16_5.jpg\" lazy-load preload fade></plastic-image>  - a big number of epic selfies :)  <plastic-image srcset=\"/images/posts/summary16_6.jpg\" lazy-load preload fade></plastic-image>  - the silent party was definitely something new for everyone! People rocked the floor like they never do before!  <plastic-image srcset=\"/images/posts/summary16_8.jpg\" lazy-load preload fade></plastic-image>   The conference became possible through the support of a number of companies. **Big THANK** to all of DevFest’s sponsors, namely: - *General partner* - [Google](https://www.google.com.ua/intl/en/about/) - *Diamond partner* - [intouch](http://www.intouchmena.com/) - *Platinum partners* - [CoreValue](http://www.corevalue.com.ua/), [GlobalLogic](http://www.globallogic.com/), [Wolters Kluwer](http://wolterskluwer.com/), [N-iX](http://n-ix.com/), [Mirantis](https://www.mirantis.com/), [DataArt](http://dataart.ua/), [Zalando](https://tech.zalando.de/), [FM Standart](http://fm-standard.com/en), [Design Proof](http://designprof.com.ua/) - Gold partners -  [Ciklum](https://www.ciklum.com/), [Sigma](http://sigma.software/), [Rucus](https://www.ruckuswireless.com/).  And, of course, a BIG THANK to all the volunteers from different GDG groups of Ukraine for their priceless help.  <plastic-image srcset=\"/images/posts/summary16_7.jpg\" lazy-load preload fade></plastic-image>  We hope you found the conference informative and worthwhile. The primary goal of DevFest  was to bring together all of you - professionals and passionate geeks of our industry - from around the world to exchange experience, share valuable knowledges and to contribute in possible strategies as to how Ukraine can become recognized and more engaged in initiatives taking place in developing IT industry and education first of all.  Your presence helped to make this event a great success, and your enthusiasm and positive spirit helped to make our time together both productive and fun.  We wish you all the best and hope that you continue to be engaged with the DevFest Ukraine. BTW, stay tuned for upcoming events by visiting [lviv.gdg.org.ua](http://lviv.gdg.org.ua/) and subscribing to our news, like us on [Facebook](https://facebook.com/GDGLviv) and follow on [Twitter](https://twitter.com/intent/user?screen_name=GDGLviv)!  Post-Conference Follow-Up ------------------------- As a reminder, we are working on transcribing the plenary sessions' slides (in ~1 week) and HD video records (in ~1-2 months), and once everything has been aggregated, we’ll notify you.  Please visit our Facebook [page](https://www.facebook.com/GDGLviv/) to view the photos, or the DevFest [website](https://devfest.gdg.org.ua/) in one week.  See you at the next events!   With love,  GDG DevFest Ukraine Team",
      "image" : "/images/posts/summary16_1.jpg",
      "published" : "2016-09-10",
      "source" : "/data/posts/2016-09-10-dfua-summary.md",
      "title" : "DevFest Ukraine rocked - SUMMARY"
    },
    "dfua17-announced" : {
      "backgroundColor" : "#2196F3",
      "brief" : "It is official. GDG DevFest Ukraine 2017 is going to take place in Lviv, on October 13-14.",
      "content" : "It is official. GDG DevFest Ukraine 2017 is going to take place in **Lviv, on October 13-14**.  Described by many as \"Google I/O of Ukraine\", DevFest has grown from the small 100-people event to the biggest Google tech conference in the Central and Eastern Europe. This year, we expect over 900 engineers, managers, and entrepreneurs from over 20 countries come to DevFest to learn about Android, Web and Cloud technologies, and to experience the phenomenal atmosphere.  ## What to expect?  **3 parallel Tracks and Workshops Area.** You asked, we did. We're building an additional stage and expanding Workshops Area to highlight even more topics and provide more hands-on time.  **Only experience based presentations.** Speakers from product companies like Google, Intel, Amazon, and Twilio. We take talk selection seriously. Our program committee carefully screens each and every submission.  **Expo Area.** Smart home, IoT, AR/VR devices, face emotions recognition using Google Cloud. Interested? With the help of GDG groups from all around Ukraine, DevFest is going to feature the biggest Expo Area on Google related devices and technologies.  **Unique networking and party.** Network with other like-minded industry colleagues and DevFest partners throughout the event and after-party.  <div layout horizontal center-justified> <a href=\"https://2event.com/events/800690\" rel=\"noopener noreferrer\">   <paper-button primary>Buy ticket</paper-button> </a> </div>   ## Stay in touch  We've already got first confirmations from speakers from Google, Twilio and Telerik. Subscribe to [DevFest newsletter](https://gdg.us11.list-manage.com/subscribe/post?u=b7e853a79164ddfdbda3ed77b&amp;id=7993e39fbe) or follow us on [Facebook](https://www.facebook.com/devfest.ukraine/), [Twitter](https://twitter.com/devfest_ukraine) and [Instagram](https://www.instagram.com/devfestukraine) not to miss new speakers announcements and conference updates.   <span><i> We can't wait to meet you in Lviv, the rising tech capital of Ukraine.</br> GDG DevFest Ukraine Team. </i></span>",
      "image" : "/images/posts/dfua17-announced.jpg",
      "published" : "2017-02-06",
      "source" : "/data/posts/2017-02-06-dfua17-announced.md",
      "title" : "Announcing GDG DevFest Ukraine 2017"
    },
    "thank-you" : {
      "backgroundColor" : "#5a7785",
      "brief" : "Our team wants to thank one more time our partners, who made GDG DevFest Ukraine 2016 possible...",
      "content" : "We want to thank one more time our partners, who made [DevFest 2016](https://devfest.gdg.org.ua/) possible! THANK YOU for being creative and motivating our participants for new challenges, THANK YOU for your experiments and expertise during the insane 2 days of GDG DevFest Ukraine. With love, GDG DevFest Ukraine Team",
      "image" : "/images/posts/thankyou_2.jpg",
      "published" : "2016-09-29",
      "source" : "/data/posts/2016-09-29-thank-you.md",
      "title" : "Thank you all for your support"
    },
    "what-to-do-in-lviv" : {
      "backgroundColor" : "#009688",
      "brief" : "Ukrainian city of Lviv is no doubt one of the most charming and yet not well-known parts of Ukraine.",
      "content" : "Ukrainian city of Lviv is no doubt one of the most charming and yet not well-known parts of Ukraine. It’s been recently gaining plenty of attention from the world, and was proudly featured on [BBC](https://www.youtube.com/watch?v=PkK93bCIofk&list=FLSdbB5_2f0i17sH1Bo-WR9A&index=1&feature=plpp_video) and [EuroNews](https://www.youtube.com/watch?v=PkK93bCIofk&list=FLSdbB5_2f0i17sH1Bo-WR9A&index=1&feature=plpp_video). City’s impressive architecture, absense of large tourist crowds and unique combination of rustiness and timelessness bring out a very special charm, capturing the hearts of everyone who’s ever visited it.  For the perfect vacation in Lviv, check out our extensive compiled selection of top things to do in Lviv!  ## Walk around Rynok Square  UNESCO-listed Rynok Square is one of the top attractions in the city! Your first stop in Lviv will inevitably lead you to the heart of the city – Rynok Square, that can be translated as Market Square. For the past 500 years it has been the bustling center of city life and till now retains all the charm of the old European city, without the pretentions of its more famous neighbors – Prague and Krakow. **Where to find:** in the very city center, hard to miss! **When to visit:** any time **How much to pay:** for FREE  ## Climb City Town Hall <plastic-image srcset=\"/images/posts/lviv2.jpg\" lazy-load preload fade></plastic-image>  How about spending 15 min counting up all the steps in Lviv Town Hall? Getting to its top is one of the most fun things to do in Lviv! We won’t break the secret to you, but will hint that the staircase has more than 300, but less than 500 steps. As they wind up to the tiny round tube at the top of the tower, the counting is even more interesting! **Where to find:** right in the middle of the Market Square (hard to miss!) **When to visit:** Tuesday – Friday from 10 am till 5 pm, Saturday – Sunday from 11 am till 7 pm. It is closed on Mondays. **How much to pay:** 5 UAH, which is 0.5 EURO  ## Take a photo with Neptun <plastic-image srcset=\"/images/posts/lviv3.jpg\" lazy-load preload fade></plastic-image>  Even though Lviv Rynok Square has a total of four fountains at each side – Diana, Neptune, Adonise and Amphitrite, local Lviv residents give their special love to Neptune. ‘Where shall we meet?’ – ‘At Neptune!’ is a typical phrase in conversations of Lviv university students.  **Where to find:** at the Rynok Square, hard to miss! **When to visit:** anytime of the year **How much to pay:** for FREE  ## Choose your favorite coffee in Svit Kavy <plastic-image srcset=\"/images/posts/lviv4.jpg\" lazy-load preload fade></plastic-image>  If you are looking for locals’ all-favorite place to sit around and watch the life pass by, go straight to the charming little coffee shop right opposite to the Boim’s Chapel and Latin Cathedral. Svit Kavy or the World of Coffee is famous for its beautiful interior, lovely summer terrace and, of course, more than 30 varieties of coffee to taste! Deliciously brewed, it will take you to the core of what Lviv is all about. **Where to find:** Katedral’na Sq. 6, between Amadeus Restaurant and Cafe1.  Svit Kavy also has a souvenir-shop that sells coffee-themed souvenirs and coffee beans; look for it to the left of the café’s main entrance **When to visit:** Mon – Fri: 8 a.m. to 8 p.m.; Sat, Sun: 9 a.m. – 11 p.m. The best time is the end of September during traditional Coffee Festival **How much to pay:** starting from 3 EURO and up  ## Buy handmade chocolate at the Lviv Chocolate Workshop <plastic-image srcset=\"/images/posts/lviv5.jpg\" lazy-load preload fade></plastic-image>  No one has the heart to pass by this tiny shop and its large glass window, stocked with rows of delicious tempting chocolate.  Right off the Rynok square, it’s a must visit place for anyone with sweet tooth. Or – what the heck – simply anyone! While first floor hosts a lovely cafe, the biggest attraction of the place – the chocolate shop – is up the narrow winding stairs. The shop features plenty of chocolate souvenirs – truffles, bars and figures of famous buildings. All the chocolate is handmade, straight from the factory, and packaged in beautiful wrapping. One perfect souvenir from Lviv! **Where to find:** Serbska st., 3 **When to visit:** Anytime of the year, 9 a.m. – 23.00. However, best time for chocolate tasting is during city’s Chocolate Festival (first week of February) **How much to pay:** 5-10 EURO at a coffee shop, 10-15 EURO at the gift shop (credit cards are accepted only at the gift shop)  ## Enjoy performances at Lviv Opera Theater <plastic-image srcset=\"/images/posts/lviv6.jpg\" lazy-load preload fade></plastic-image>  Much can be written about this most famous Lviv landmark. Known as the Grand Theater originally, it is now formally called The Lviv National Academic Theater of Opera and Ballet of Solomiya Krushelnyts’ka, in honor of Ukraine’s most well-known female opera singer. The Lviv Opera House was built in 1900 using forms of Renaissance and Baroque architecture. The result is one of the most beautiful opera houses in Europe with a luxurious interior, including the Mirror Hall and Parnassus Curtain and a stunning facade with ornate sculpture work. **Where to find:** Svobody ave., 28 **When to visit:** 11 am – 7 pm, tours are available starting from 5 pm. Alternatively, you can buy an entrance ticket and tour around the theater on your own. **How much to pay:** performance tickets cost from 0.5 EURO to 20 EURO, self-guided tour ticket is 1 EURO.  ## Take bird view photos of Lviv from the High Castle hill <plastic-image srcset=\"/images/posts/lviv7.jpg\" lazy-load preload fade></plastic-image>  Lviv High Castle can be both a major disappointment and biggest surprise to you! Why disappointment? Because despite its promising name, the place is not that high (unless 413 m is impressive for you) and has no castle whatsoever. Why surprise? Because it offers a quiet refuge from the busy city streets, and it has indubitably the best aerial views of the city! The hill, also known as Vysoky Zamok, used to be a wooden fortress, built in the 13th century by King Lev.  **Where to find:** High Castle (Vysokyi Zamok) is located just outside Lviv’s center inside Vysokyi Zamok Park. There are no direct transport links to the park, so wear good shoes and  enjoy the 15-20-minute walk from the center.  Just follow the small brown signs. **When to visit:** sunny weather is the best for great bird view of the city **How much to pay:** for FREE  ## Explore Lviv underground labyrinths <plastic-image srcset=\"/images/posts/lviv8.jpg\" lazy-load preload fade></plastic-image>  Would you like to check out the 18th century sarcophagus made from a solid stone? Its cover weighs over 600 kg. The object itself is taken apart, but the nature of wreckage indicates that sarcophagus was broken not from the outside, but …from the inside! Eerie, isn’t it? To hear the full Black Monk legend, head to the catacombs of St. Peter and Paul Cathedral of Jesuit Order.   **Where to find:** [Contact](www.activeukraine.com/contact-us/) to arrange for an underground tour of Lviv **When to visit:** any time in the day **How much to pay:** depending on your group size  ## Explore the weaponry collection at Lviv History Museum ‘Arsenal’ <plastic-image srcset=\"/images/posts/lviv9.jpg\" lazy-load preload fade></plastic-image>  Unquestionably, the biggest attraction for any male traveler in Lviv! Museum boasts thousands of weaponry items from more than 30 countries and as old as 10th century. Knives, daggers, swords, sabers, épées, yatagans, axes, halberds, maces, czekans, pernaches, and many other strange names of cold, fire and defensive weapons that will keep your interest throughout all the exhibit. The collection’s highlight is Eastern type sword from the 17th century with double blade, the so-called “Zulfakar”. **Where to find:** Pidvalna st., 5 – close to the town center **When to visit:** daily 10:00 – 17:30, except Wednesdays **How much to pay:** less than 1 EURO, extra fee is charged for photo and video footage  These and a lot of others impressive things you can do and see in Lviv!!! Try most of them! I bet you will be thrilled!",
      "image" : "/images/posts/lviv1.jpg",
      "published" : "2016-08-20",
      "source" : "/data/posts/2016-08-20-what-to-do-in-lviv.md",
      "title" : "What to do in Lviv"
    }
  },
  "gallery" : [
    "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/gallery%2FIMG_0010.jpg?alt=media&token=d199c844-6ab0-4e7d-9d6e-e61a3d07c343",
    "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/gallery%2FIMG_20190126_093728.jpg?alt=media&token=4b2b8856-6072-4c50-89a9-2038ad04cf27",
    "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/gallery%2FIMG_20190126_113932.jpg?alt=media&token=fd9e1f5b-ab6d-4b05-af2b-ed50375f4acd",
    "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/gallery%2FIMG_20190126_122022.jpg?alt=media&token=c620a700-ca07-408d-bd14-fe44140b6956",
    "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/gallery%2FIMG_20190126_152227.jpg?alt=media&token=867d3214-13ec-4fd5-b71a-6dc69389066a",
    "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/gallery%2FIMG_9734.jpg?alt=media&token=5cb31181-531d-4663-ba40-46c831656525",
    "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/gallery%2FIMG_9739.jpg?alt=media&token=a50a7697-fb4b-4437-81da-c067c6b2793f",
    "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/gallery%2FIMG_9915.jpg?alt=media&token=e1888cca-c3a9-4d92-9c85-e0942943df2d"
  ],
  "notifications" : {
    "config" : {
      "icon" : "",
      "timezone" : "+00:00"
    },
    "messages" : { },
    "subscribers" : { },
    "test" : { },
    "users" : { }
  },
  "partners" : [{
    "logos" : [  {
      "order" : 0,
      "logoUrl" : "../images/logos/XING.png",
      "name" : "XING",
      "url" : "https://www.xing.com/"
    }],
    "order" : 0,
    "title" : "Gold Sponsors"
  } , {
    "logos" : [ {
      "order" : 0,
      "logoUrl" : "../images/logos/dx.svg",
      "name" : "Devexperts",
      "url" : "https://devexperts.com/"
    }],
    "order" : 1,
    "title" : "Silver Sponsors"
  } , {
    "logos" : [ {
      "order" : 0,
      "logoUrl" : "../images/logos/dashdash.png",
      "name" : "dashdash",
      "url" : "https://dashdash.com/"
    }, {
      "order" : 1,
      "logoUrl" : "../images/logos/mindera.png",
      "name" : "Mindera",
      "url" : "https://mindera.com/"
    }],
    "order" : 2,
    "title" : "Bronze Sponsors"
  } , {
    "logos" : [ {
      "order" : 0,
      "logoUrl" : "../images/logos/google.svg",
      "name" : "Google",
      "url" : "https://www.google.com.ua/intl/en/about/"
    }, {
      "order" : 1,
      "logoUrl" : "../images/logos/wtm.png",
      "name" : "WTM",
      "url" : "https://www.womentechmakers.com/"
    },{
      "order" : 2,
      "logoUrl" : "../images/logos/ISEP.png",
      "name" : "ISEP",
      "url" : "https://www.isep.ipp.pt/"
    }, {
      "order" : 3,
      "logoUrl" : "../images/logos/last2ticket.png",
      "name" : "Last2Ticket",
      "url" : "https://hello.last2ticket.com/"
    }],
    "order" : 3,
    "title" : "General Partner"
  }, {
    "logos" : [ {
      "order" : 0,
      "logoUrl" : "../images/logos/gdg-lviv.svg",
      "name" : "GDG Lviv",
      "url" : "https://www.meetup.com/GDG-Lviv/"
    } ],
    "order" : 10,
    "title" : "Template Creator"
  }
  ],
  "schedule" : {
    "2020-04-04" : {
      "dateReadable" : "April 4",
      "timeslots" : [ {
        "sessions" : [ {
          "items" : [ 90 ]
        } ],
        "startTime" : "09:00",
        "endTime" : "09:30"
      }, {
        "sessions" : [ {
          "items" : [ 91 ]
        } ],
        "startTime" : "09:30",
        "endTime" : "09:40"
      }, {
        "sessions" : [ {
          "items" : [ 100 ]
        } ],
        "startTime" : "09:40",
        "endTime" : "10:00"
      }, {
        "sessions" : [ {
          "items" : [ 99 ]
        } ],
        "startTime" : "10:00",
        "endTime" : "10:05"
      }, {
        "sessions" : [ {
          "items" : [ 101 ]
        }, {
          "items" : [ 102 ]
        }, {
          "extend" : 2,
          "items" : [ 103 ]
        } ],
        "startTime" : "10:05",
        "endTime" : "10:45"
      }, {
        "sessions" : [  {
          "items" : [ 104 ]
        }, {
          "items" : [ 105 ]
        } ],
        "startTime" : "10:45",
        "endTime" : "11:25"
      },{
        "sessions" : [ {
          "items" : [ 99 ]
        } ],
        "startTime" : "11:25",
        "endTime" : "11:30"
      },{
        "sessions" : [ {
          "items" : [ 106 ]
        }, {
          "items" : [ 107 ]
        }, {
          "extend" : 2,
          "items" : [ 108 ]
        } ],
        "startTime" : "11:30",
        "endTime" : "12:10"
      }, {
        "sessions" : [  {
          "items" : [ 109 ]
        }, {
          "items" : [ 110 ]
        } ],
        "startTime" : "12:10",
        "endTime" : "12:50"
      }, {
        "sessions" : [ {
          "items" : [ 92 ]
        } ],
        "startTime" : "12:50",
        "endTime" : "14:10"
      },  {
        "sessions" : [ {
          "items" : [ 111 ]
        }, {
          "items" : [ 112 ]
        }, {
          "extend" : 2,
          "items" : [ 113 ]
        } ],
        "startTime" : "14:10",
        "endTime" : "14:50"
      }, {
        "sessions" : [  {
          "items" : [ 114 ]
        }, {
          "items" : [ 115 ]
        } ],
        "startTime" : "14:50",
        "endTime" : "15:30"
      },{
        "sessions" : [ {
          "items" : [ 99 ]
        } ],
        "startTime" : "15:30",
        "endTime" : "15:35"
      },{
        "sessions" : [ {
          "items" : [ 116 ]
        }, {
          "items" : [ 117 ]
        }, {
          "extend" : 2,
          "items" : [ 118 ]
        } ],
        "startTime" : "15:35",
        "endTime" : "16:15"
      }, {
        "sessions" : [  {
          "items" : [ 119 ]
        }, {
          "items" : [ 120 ]
        } ],
        "startTime" : "16:15",
        "endTime" : "16:55"
      }, {
        "sessions" : [ {
          "items" : [ 93 ]
        } ],
        "startTime" : "16:55",
        "endTime" : "17:15"
      }, {
        "sessions" : [ {
          "items" : [ 121 ]
        }, {
          "items" : [ 122 ]
        } ],
        "startTime" : "17:15",
        "endTime" : "17:55"
      }, {
        "sessions" : [ {
          "items" : [ 123 ]
        }, {
          "items" : [ 124 ]
        } ],
        "startTime" : "17:55",
        "endTime" : "18:35"
      },  {
        "sessions" : [ {
          "items" : [ 94 ]
        } ],
        "startTime" : "18:35",
        "endTime" : "18:55"
      } ],
      "tracks" : [ {
        "title" : "Auditório Magno"
      }, {
        "title" : "Auditório H"
      }, {
        "title" : "Workshops room - 1st floor"
      } ]
    }
  },
  "sessions" : {
    "90" : {
      "description" : "Get your badge, coffee, enjoy talking with tech edicts around",
      "icon" : "registration",
      "image" : "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fregistration.jpg?alt=media&token=27328646-d323-4cca-904c-75f021bc3ffe",
      "title" : "Registration & morning Coffee"
    },
    "91" : {
      "description" : "Official start of the conference. Greetings from the organizers, sponsors and partners.",
      "icon" : "opening",
      "image" : "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fopening.jpg?alt=media&token=aa52dd45-50c9-4e36-9485-c1f9138ecd6b",
      "language" : "English",
      "title" : "GDG DevFest Porto Opening"
    },
    "92" : {
      "description" : "Foooooooood!",
      "icon" : "lunch",
      "image" : "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Flunch.jpg?alt=media&token=bc82aaff-92cc-4dcc-a00e-2b6f30a40225",
      "title" : "Lunch"
    },
    "93" : {
      "description" : "Coffeeeeeee!",
      "icon" : "coffee-break",
      "image" : "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fcoffee-break.jpg?alt=media&token=7c2c929b-cb94-4be8-a05a-b3f678136cb7",
      "title" : "Coffee break"
    },
    "94" : {
      "description" : "Make sure you won't miss closing ceremony, all gifts from out sponsors and partners will find their owners during this session.",
      "icon" : "party",
      "image" : "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fclosing.jpg?alt=media&token=f02d014a-09ee-407e-88c7-b74093e00fed",
      "title" : "Conference closing and contest winners announcements"
    },
    "99" : {
      "description" : "You have 5 minutes to move between rooms if you want to be in another session",
      "divider": true,
      "title" : "Get a room!"
    },
    "100" : {
      "description" : "",
      "language" : "English",
      "title" : "Keynote"
    },
    "101" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker1" ],
      "tags" : [ "Android"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "102" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker2" ],
      "tags" : [ "Web"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "103" : {
      "complexity" : "Beginner",
      "description" : "Workshop - Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker3" ],
      "tags" : [ "Cloud"],
      "title" : "Workshop - Coming soon",
      "videoId" : "qweqwe"
    },
    "104" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker4" ],
      "tags" : [ "Android"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "105" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker5" ],
      "tags" : [ "Web"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "106" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker6" ],
      "tags" : [  "Android"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "107" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker7" ],
      "tags" : [ "Web"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "108" : {
      "complexity" : "Beginner",
      "description" : "Workshop - Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker8" ],
      "tags" : [ "Cloud"],
      "title" : "Workshop - Coming soon",
      "videoId" : "qweqwe"
    },
    "109" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker9" ],
      "tags" : [ "Android"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "110" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker10" ],
      "tags" : [ "Web"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "111" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker11" ],
      "tags" : [ "Android"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "112" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker12" ],
      "tags" : [ "Design"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "113" : {
      "complexity" : "Beginner",
      "description" : "Workshop - Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker13" ],
      "tags" : [ "Web"],
      "title" : "Workshop - Coming soon",
      "videoId" : "qweqwe"
    },
    "114" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker14" ],
      "tags" : [ "Android"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "115" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker15" ],
      "tags" : [ "Design"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "116" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker16" ],
      "tags" : [ "Web"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "117" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker17" ],
      "tags" : [ "Product Placement"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "118" : {
      "complexity" : "Beginner",
      "description" : "Workshop - Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker18" ],
      "tags" : [ "Android"],
      "title" : "Workshop - Coming soon",
      "videoId" : "qweqwe"
    },
    "119" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker19" ],
      "tags" : [ "Web"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "120" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker20" ],
      "tags" : [ "Marketing"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "121" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker21" ],
      "tags" : [ "Cloud", "Android", "Web"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "122" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker22" ],
      "tags" : [ "Cloud", "Android", "Web"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "123" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker23" ],
      "tags" : [ "Cloud", "Android", "Web"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "124" : {
      "complexity" : "Beginner",
      "description" : "Coming soon...",
      "language" : "English",
      "presentation" : "",
      "speakers" : [ "speaker24" ],
      "tags" : [ "Cloud", "Android", "Web"],
      "title" : "Coming soon",
      "videoId" : "qweqwe"
    },
    "140" : {
      "description" : "TBD",
      "language" : "English",
      "title" : "TBD"
    }
  },
  "speakers" : {
    "speaker1" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "badges" : [ {
        "description" : "Android Google Developer Expert",
        "link" : "https://developers.google.com/experts/",
        "name" : "gde"
      }, {
        "description" : "Google Developers Group",
        "link" : "https://developers.google.com/groups/chapter//",
        "name" : "gdg"
      } ],
      "order" : 0,
      "title" : ""
    },
    "speaker2" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 1,
      "title" : ""
    },
    "speaker3" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 2,
      "title" : ""
    },
    "speaker4" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 3,
      "title" : ""
    },
    "speaker5" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 4,
      "title" : ""
    },
    "speaker6" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 5,
      "title" : ""
    },
    "speaker7" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 6,
      "title" : ""
    },
    "speaker8" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 7,
      "title" : ""
    },
    "speaker9" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 8,
      "title" : ""
    },
    "speaker10" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 9,
      "title" : ""
    },
    "speaker11" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 10,
      "title" : ""
    },
    "speaker12" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 11,
      "title" : ""
    },
    "speaker13" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 12,
      "title" : ""
    },
    "speaker14" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 13,
      "title" : ""
    },
    "speaker15" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 14,
      "title" : ""
    },
    "speaker16" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 15,
      "title" : ""
    },
    "speaker17" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 16,
      "title" : ""
    },
    "speaker18" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 17,
      "title" : ""
    },
    "speaker19" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 18,
      "title" : ""
    },
    "speaker20" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 19,
      "title" : ""
    },
    "speaker21" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 20,
      "title" : ""
    },
    "speaker22" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 21,
      "title" : ""
    },
    "speaker23" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 22,
      "title" : ""
    },
    "speaker24" : {
      "bio" : "",
      "company" : "",
      "companyLogo" : "",
      "companyLogoUrl" : "",
      "country" : "",
      "featured" : true,
      "name" : "To be Announced",
      "photo" : "/images/people/tobeconfirmed.png",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/people%2Ftobeconfirmed.png?alt=media&token=05fe3451-68d4-43cb-9af0-8e66168e0969",
      "pronouns": "he/him",
      "shortBio" : "",
      "socials" : [
        {
          "icon": "website",
          "name": "Website",
          "link": ""
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": ""
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": ""
        },
        {
          "icon": "github",
          "name": "GitHub",
          "link": ""
        },
        {
          "icon": "gplus",
          "name": "Google+",
          "link": ""
        } ],
      "order" : 23,
      "title" : ""
    }
  },
  "team" : [ {
    "members" : [ {
      "name" : "Oleh Zasadnyy",
      "photo" : "/images/people/oleh_zasadnyy.jpg",
      "photoUrl" : "https://storage.googleapis.com/hoverboard-experimental.appspot.com/images/people/optim/oleh_zasadnyy.jpg",
      "socials" : [ {
        "icon" : "facebook",
        "link" : "https://www.facebook.com/oleh.zasadnyy",
        "name" : "Facebook"
      }, {
        "icon" : "twitter",
        "link" : "https://twitter.com/ozasadnyy",
        "name" : "Twitter"
      }, {
        "icon" : "website",
        "link" : "http://o.zasadnyy.com/",
        "name" : "Blog"
      } ],
      "order" : 0,
      "title" : "Website and sponsors"
    }, {
      "name" : "Sofiya Huts",
      "photo" : "/images/people/sofiya_huts.jpg",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fpeople%2Fsofiya_huts.jpg?alt=media&token=a911eafb-f709-4af7-b1cb-58a6604b70d1",
      "socials" : [ {
        "icon" : "facebook",
        "link" : "https://www.facebook.com/sophie.huts.7",
        "name" : "Facebook"
      } ],
      "order" : 1,
      "title" : "Social and media"
    }, {
      "name" : "Vitaliy Zasadnyy",
      "photo" : "/images/people/vitaliy_zasadnyy.jpg",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fpeople%2Fvitaliy_zasadnyy.jpg?alt=media&token=930e05c8-ae43-4628-8d4c-3e8f5193cda3",
      "socials" : [ {
        "icon" : "linkedin",
        "link" : "https://www.linkedin.com/in/zasadnyy",
        "name" : "Linkedin"
      }, {
        "icon" : "twitter",
        "link" : "https://twitter.com/zasadnyy",
        "name" : "Twitter"
      }, {
        "icon" : "website",
        "link" : "http://v.zasadnyy.com/",
        "name" : "Blog"
      } ],
      "order" : 2,
      "title" : "Speakers"
    }, {
      "name" : "Marta Maxymiak",
      "photo" : "/images/people/marta_maxymiak.jpg",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fpeople%2Fmarta_maxymiak.jpg?alt=media&token=6532f039-7f86-4304-8558-dbfbb3ae8d68",
      "socials" : [ {
        "icon" : "facebook",
        "link" : "https://www.facebook.com/marta.maxymiak",
        "name" : "Facebook"
      } ],
      "order" : 3,
      "title" : "Party and happiness"
    }, {
      "name" : "Ostap Andrusiv",
      "photo" : "/images/people/ostap_andrusiv.jpg",
      "photoUrl" : "https://storage.googleapis.com/hoverboard-experimental.appspot.com/images/people/optim/ostap_andrusiv.jpg",
      "socials" : [ {
        "icon" : "facebook",
        "link" : "https://www.facebook.com/ostap.andrusiv",
        "name" : "Facebook"
      }, {
        "icon" : "twitter",
        "link" : "https://twitter.com/p1f",
        "name" : "Twitter"
      }, {
        "icon" : "website",
        "link" : "http://andrusiv.com/",
        "name" : "Blog"
      } ],
      "order" : 4,
      "title" : "Sponsors"
    }, {
      "name" : "Vasylyna Mytsak",
      "photo" : "/images/people/vasylyna_mytsak.jpg",
      "photoUrl" : "https://storage.googleapis.com/hoverboard-experimental.appspot.com/images/people/optim/vasylyna_mytsak.jpg",
      "socials" : [ {
        "icon" : "facebook",
        "link" : "https://www.facebook.com/vasylyna.mytsak",
        "name" : "Facebook"
      } ],
      "order" : 5,
      "title" : "Party and happiness"
    }, {
      "name" : "Volodya Karpliuk",
      "photo" : "/images/people/volodya_karpliuk.jpg",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fpeople%2Fvolodya_karpliuk.jpg?alt=media&token=aa08d9c9-c42a-435f-8672-c3a004e3aa08",
      "socials" : [ {
        "icon" : "facebook",
        "link" : "https://www.facebook.com/volodya.karpluk",
        "name" : "Facebook"
      }, {
        "icon" : "twitter",
        "link" : "https://twitter.com/keyv23",
        "name" : "Twitter"
      } ],
      "order" : 6,
      "title" : "Speakers"
    }, {
      "name" : "Diana Pinchuk",
      "photo" : "/images/people/diana_pinchuk.jpg",
      "photoUrl" : "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fpeople%2Fdiana_pinchuk.jpg?alt=media&token=189d67d1-004f-4a3c-9e0c-13bc992bbaf7",
      "socials" : [ {
        "icon" : "facebook",
        "link" : "https://www.facebook.com/diana.pinchuk.9",
        "name" : "Facebook"
      } ],
      "order" : 7,
      "title" : "Social and media"
    } ],
    "title" : "Core Team"
  }, {
    "members" : [ {
      "name" : "Ihor Dvoretskyi",
      "photo" : "/images/people/ihor_dvoretskyi.jpg",
      "photoUrl" : "",
      "socials" : [ {
        "icon" : "facebook",
        "link" : "https://www.facebook.com/idvoretskyi",
        "name" : "Facebook"
      }, {
        "icon" : "twitter",
        "link" : "https://twitter.com/idvoretskyi",
        "name" : "Twitter"
      } ],
      "order" : 0,
      "title" : "Cloud stream"
    }, {
      "name" : "Dmytro Danylyk",
      "photo" : "/images/people/dmytro_danylyk.jpg",
      "photoUrl" : "",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/dmytrodanylyk",
        "name" : "Twitter"
      }, {
        "icon" : "website",
        "link" : "http://www.dmytrodanylyk.com/#/about",
        "name" : "Website"
      } ],
      "order" : 1,
      "title" : "Android Stream"
    } ],
    "title" : "Program Committee"
  } ],
  "tickets" : [ {
    "available" : true,
    "currency" : "€",
    "ends" : "Apr 3",
    "info" : "Requires valid student/lecturer ID",
    "name" : "Student ticket",
    "price" : 5,
    "soldOut" : false,
    "starts" : "Feb 8",
    "url" : "https://hello.last2ticket.com/event/2769"
  }, {
    "available" : true,
    "currency" : "€",
    "ends" : "Apr 3",
    "inDemand" : true,
    "info" : "That normal, simple, regular ticket",
    "name" : "Regular ticket",
    "price" : 10,
    "regular" : true,
    "soldOut" : false,
    "starts" : "Feb 7",
    "url" : "https://hello.last2ticket.com/event/2769"
  }, {
    "available" : true,
    "currency" : "€",
    "ends" : "Apr 3",
    "info" : "\"I like to help and will donate more to the cause\" ticket",
    "name" : "Helper ticket",
    "price" : 15,
    "soldOut" : false,
    "starts" : "Feb 7",
    "url" : "https://hello.last2ticket.com/event/2769"
  } ],
  "triggers" : {
    "images" : false
  },
  "videos" : [ {
    "speakers" : "Carlos Mota",
    "thumbnail" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/thumbnails%2Fcarlosmota_videoThumb.jpg?alt=media&token=8f901471-4e72-4c62-9ffa-80e569f947b6",
    "title" : "Kotlin my way in",
    "youtubeId" : "TvoDRnwMGYQ"
  }, {
    "speakers" : "Sara Vieira",
    "thumbnail" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/thumbnails%2Fsaravieira_videoThumb.jpg?alt=media&token=edabd266-68c3-4766-b940-d64a5c7391d6",
    "title" : "I have 99 problems but GraphQL is not one",
    "youtubeId" : "Sn7u1EpLdwg"
  }, {
    "speakers" : "Sam Bellen",
    "thumbnail" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/thumbnails%2Fsambellen_videoThumb.jpg?alt=media&token=c5175969-e09a-45b0-a157-bd2cb729065c",
    "title" : "Passwords are so 1990",
    "youtubeId" : "PEgqE8MvSEU"
  }, {
    "speakers" : "Alex Barlow",
    "thumbnail" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/thumbnails%2Falexbarlow_videoThumb.jpg?alt=media&token=487e3d83-bc05-4091-b9ea-0bc14f8be4a7",
    "title" : "Microservices in the real world",
    "youtubeId" : "6ZLaw5IU8f8"
  }, {
    "speakers" : "João Teixeira",
    "thumbnail" : "https://firebasestorage.googleapis.com/v0/b/devfest19-20.appspot.com/o/thumbnails%2Fjoaoteixeira_videoThumb.jpg?alt=media&token=92cd5ffb-d6a8-4dfc-903d-75ccfc01bef3",
    "title" : "Designers want to destroy the world",
    "youtubeId" : "zTHPnzuqfc8"
  } ],
  "previousSpeakers": {
    "sascha_wolter": {
      "id": "sascha_wolter",
      "name": "Sascha Wolter",
      "country": "Munich and Dusseldorf, Germany",
      "photoUrl": "/images/people/sascha_wolter.jpg",
      "title": "Senior Developer Evangelist Connected Home",
      "company": "Deutsche Telekom AG - Group Innovation+ | Freelancer",
      "bio": "Sascha Wolter is a professional developer and user experience enthusiast with passion for the Internet of Things in all flavors. He also works as a consultant, trainer, lecturer, keynote-speaker, and author who focusses on understanding, innovation and value. Sascha is the founder of the User Group flashforum.de with more than 100,000 members, and as such he is committed to the interests of the user. After organizing internationally renowned events like beyond tellerrand from 2001 to 2011, he is now board member of the Usability & User Experience committee at the federal association BITKOM. When he is not tinkering with new soft- and hardware for Deutsche Telekom AG – Connected Home, he likes discovering the world together with his kids in an odd way.",
      "shortBio": "UX enthusiast with passion for the IoT. Board member of the Usability & User Experience committee at the federal association BITKOM.",
      "tags": [
        "Web",
        "IoT",
        "Smart Home"
      ],
      "badges": [
        {
          "name": "GDE",
          "description": "Google Developer Expert for IoT",
          "link": "https://developers.google.com/experts/people/sascha-wolter"
        }
      ],
      "sessions": {
        "2016": [
          {
            "title": "My Minecraft-Smart-Home: Prototyping the Internet of Uncanny",
            "description": "Software solutions and everyday objects are becoming increasingly \"smarter\", take over more \"responsibility\" and know more and more about us and our intentions. But what does that mean for developers, and what impact does this have on the user? How do we convey the understanding and competence for this Internet of Things? Sascha Wolter covers typical IoT challenges and inspires with crazy and sometimes creepy examples. He also introduces a prototypic approach for hardware and software ideation based on visual programming languages, games like Minecraft, and several IDEs. Of course, it is shown that this pragmatic approach is also suitable for professional projects using IoT platforms and smart home solutions such as Google Weave, Eddystone Beacons, Eclipse SmartHome, or openHAB.",
            "tags": [
              "IoT"
            ],
            "videoId": "VLW9_Hl9M9E"
          }
        ]
      },
      "socials": [
        {
          "icon": "website",
          "name": "Website",
          "link": "http://www.wolter.biz"
        },
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": "http://twitter.com/saschawolter"
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": "http://www.linkedin.com/pub/sascha-wolter/5/a38/493"
        }
      ]
    },
    "marco_perestrelo": {
      "id": "marco_perestrelo",
      "name": "Marco Perestrelo",
      "country": "Porto, Portugal",
      "photoUrl": "/images/people/marco_perestrelo.jpg",
      "company": "i2S",
      "companyLogo": "/images/logos/i2s.png",
      "title": "Head of Product Development",
      "bio": "Marco is the Head of Product Development at i2S. You can say he’s a big fish around here, but better not tell him because he likes to think of himself as an agile deer. He has more than 20 years’ experience in IT and almost 10 years´ experience in insurance (would you now call it Insurtech?) as the CIO of an insurance company (pre-financial melt-down) and for an insurance broker, part of the Sonae Group.  That totals more than 30 years which is really strange since he’s only 29 years old. So is he some kind of insurance magician or just lying about his age? We’re not sure but we dare you to find out. Before insurance Marco worked for a beer company, but once he quit drinking, he moved to insurance because he through it would be safe and boring. Was he wrong?",
      "shortBio": "Marco is the Head of Product Development at i2S. He has more than 20 years experience in IT and almost 10 years experience in insurance as the CIO of an insurance company (pre-financial melt-down) and for an insurance broker, part of the Sonae Group.",
      "tags": [
        "Android",
        "Android Auto"
      ],
      "badges": [],
      "sessions": {
        "2016": [
          {
            "title": "Android Auto: driving the future",
            "description": "Google, Insurance Tech and Telematics. Add i2S to the mix and you'll be surprised!",
            "tags": [
              "Android",
              "Android Auto"
            ],
            "videoId": "Ntm2IHOX2S8"
          }
        ]
      },
      "socials": [
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": "https://www.linkedin.com/in/mperestrello"
        }
      ]
    },
    "manuel_ribeiro": {
      "id": "manuel_ribeiro",
      "name": "Manuel Ribeiro",
      "country": "Porto, Portugal",
      "photoUrl": "/images/people/manuel.jpg",
      "company": "i2S",
      "companyLogo": "/images/logos/i2s.png",
      "title": "Business Analyst Manager",
      "bio": "Don’t let yourself be fooled. Behind Manuel Ribeiro's nice smile lies a lean mean insurtech machine with more than 20 years i2S knowledge. And if you're keen on fast learners and interesting people please make sure to get to know him. He started off as a developer, making his way to the team that internationalized i2S core solutions. In a nut shell, you can say he was the playmaker. A real number 10. Afterwards, he gave himself away to the challenges of implementing i2S’s Non Life solution, (don’t worry, by Non Life we’re not talking about dead people. Attend our presentation and you’ll get it) taking part in several international projects. Nowadays, he’s one of i2S’s top experts in our Non Life insurance software. That’s how just important he is. When he passes everyone just makes a vow  and whispers:  \"there goes Manuel, the guy who holds the key for us to make the quantic leap in Non Life insurance software\". Just kidding. We don’t truly whisper that. We say it out loud. Cross our hearts and hope to die (no pun intended).",
      "shortBio": " Behind Manuel Ribeiro's nice smile lies a lean mean insurtech machine with more than 20 years i2S knowledge.",
      "tags": [
        "Android Auto",
        "Android"
      ],
      "badges": [],
      "sessions": {
        "2016": [
          {
            "title": "Android Auto: driving the future",
            "description": "Google, Insurance Tech and Telematics. Add i2S to the mix and you'll be surprised!",
            "tags": [
              "Android",
              "Android Auto"
            ]
          }
        ]
      },
      "socials": [
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": "https://www.linkedin.com/in/manuel-ribeiro-941b12110"
        }
      ]
    },
    "ben_lee": {
      "id": "ben_lee",
      "name": "Ben Lee",
      "country": "London, UK",
      "photoUrl": "/images/people/ben_lee.jpg",
      "company": "Palantir",
      "companyLogo": "/images/logos/palantir.png",
      "title": "Software Engineering Lead",
      "bio": "Software engineer at Palantir Technologies. Interested in user experience, design and what makes people click (buttons).",
      "shortBio": "Software engineer at Palantir Technologies. Interested in user experience, design and what makes people click (buttons).",
      "tags": [
        "Typescript",
        "Web",
        "React",
        "Blueprint"
      ],
      "badges": [],
      "sessions": {
        "2016": [
          {
            "title": "Typescript 101",
            "description": "The purpose of this talk is to provide an introduction to typescript. Initially this talk was about “functional typescript” but most folks showing really wanted to know more about typescript, not the functional aspect of it. So this talk aims at giving an introduction to the syntax, and how you can incrementally transform your coding style from pure javascript to typescript. In the end you’ll take home how to setup a typescript build pipeline, how these interact with react and blueprint, we will look at the transpilation and how code and structure a typescript project (including good practices and linting).",
            "tags": [
              "Typescript",
              "Web",
              "React",
              "Blueprint"
            ]
          }
        ]
      },
      "socials": [
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": "https://uk.linkedin.com/in/benjaminyplee"
        }
      ]
    },
    "mario_cordeiro": {
      "id": "mario_cordeiro",
      "name": "Mário Cordeiro",
      "country": "Porto, Portugal",
      "photoUrl": "/images/people/mario.webp",
      "company": "Critical Manufacturing",
      "companyLogo": "/images/logos/critical.png",
      "title": "Technical Manager",
      "bio": "Mário Cordeiro is Software Engineer at Critical Manufacturing and a PhD student in the Doctoral Program in Informatics Engineering at Porto University. He is currently researching Event detection in social network data streams, a cross domain research topic in the areas of Social network analysis, Natural Language Processing and Data Stream Mining. Co-organizer of the Data Science Portugal community.",
      "shortBio": "Mário Cordeiro is Software Engineer at Critical Manufacturing and a PhD student in the Doctoral Program in Informatics Engineering at Porto University.",
      "tags": [
        "Cloud",
        "TensorFlow",
        "Machine Learning"
      ],
      "badges": [],
      "sessions": {
        "2016": [
          {
            "title": "Dive deep into machine learning with TensorFlow",
            "description": "Dive deep into machine learning with TensorFlow is a high-level introduction to the TensorFlow library, architecture and API. Originally developed at Google for the purposes of conducting machine-learning and deep neural networks research, TensorFlow leverages a general computational model that is applicable in a wide variety of other domains, especially for performing large-scale numerical computations on large data. This talk explains you how to use the library to train machine-learning models and make your next application smarter.",
            "tags": [
              "Cloud",
              "TensorFlow",
              "Machine Learning"
            ],
            "videoId": "HYifHZbgb7c"
          },
          {
            "title": "TensorFlow Codelab",
            "description": "Have you ever used TensorFlow? If not, you should try it... Mário Cordeiro will be giving this workshop to follow you through a TensorFlow Codelab where you can see Machine Learning working on your laptop. After this you have everything you need to go home and start playing with it. - You can bring Docker already installed to spare some time.",
            "tags": [
              "Cloud",
              "TensorFlow",
              "Machine Learning"
            ]
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": "https://twitter.com/mmfcordeiro"
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": "https://www.linkedin.com/in/mariocordeiro"
        }
      ]
    },
    "sergi_martinez": {
      "id": "sergi_martinez",
      "name": "Sergi Martínez",
      "country": "Barcelona, Spain",
      "photoUrl": "/images/people/sergi.webp",
      "company": "Schibsted Spain",
      "title": "Android Developer",
      "bio": "Working as Android dev at Schibsted and Google Developer Expert for Android. He loves to share, teach, discuss, learn with the community",
      "shortBio": "Working as Android dev at Schibsted and Google Developer Expert for Android. He loves to share, teach, discuss, learn with the community",
      "tags": [
        "Android",
        "Realm"
      ],
      "badges": [
        {
          "name": "GDE",
          "description": "Google Developer Expert for Android",
          "link": "https://developers.google.com/experts/people/sergi-martinez"
        }
      ],
      "sessions": {
        "2015": [
          {
            "title": "Android Data Binding",
            "description": "In the I/O 15 Google introduced the Android data binding. This technology is going to change the way we create and manage Android interfaces (for good), and we will be able to use mature patterns like MVVM to drastically reduce the amount of code in our Activities and Fragments.</p><p>Despite being a technology still in beta phase and not ready for production, we will learn how it works to be ready to use it from the first day when finally published.",
            "videoId": "xdA5mHw47hM",
            "presentation": "https://drive.google.com/open?id=0B-c8KPK0BrRGWGpsOWNLclFNS1k"
          }
        ],
        "2016": [
          {
            "title": "Realm or: How I learned to stop worrying and love my app database",
            "description": "Using sql in mobile apps suck... is not nice. It makes us generate tons of boilerplate and it's slow to develop. We will talk about Realm, a new database engine (not an ORM!) for mobile that helps us to speed up our development process and suits better for mobile needs, I've been using almost from first release and I never came back to SQL. I will not only explain how it works, but also how I use it and how to avoid some common pitfalls when you start with Realm.",
            "tags": [
              "Realm",
              "Android"
            ]
          },
          {
            "title": "It's the Arts! Playing with android canvas",
            "description": "Many Android developers do not know the Canvas object or how to use the painting process. We will discuss about this process and see how to perform effects and views using the Canvas with some practical examples. Good knowledge of the Canvas and the drawing techniques could help us to do better applications and views with some spectacular effects in a few lines. (We will also vandalise some art in the workshop, just for the fun)",
            "tags": [
              "Android",
              "Canvas"
            ]
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": "https://twitter.com/Sergiandreplace"
        },
        {
          "icon": "linkedin",
          "name": "Linkedin",
          "link": "https://www.linkedin.com/in/sergimartinezlopez"
        }
      ]
    },
    "jose_santos": {
      "id": "jose_santos",
      "name": "José Santos",
      "country": "Porto, Portugal",
      "photoUrl": "/images/people/jose_santos.jpg",
      "company": "Jumia One",
      "title": "Head of development",
      "shortBio": "José Santos is leading development at Jumia Travel, the leading travelling company in Africa. ",
      "bio": "José Santos is leading development at Jumia Travel, the leading travelling company in Africa. In 2016 Jumia Travel re-think the way we deliver applications across sub saharan africa, where connection are mostly 2G and data consumption is very expensive. José is leading teams of developers to build advance mobile web applications using the progressive web apps experiences with the App toolbox from Polymer and AMP.",
      "tags": [
        "Web",
        "Polymer",
        "AMP",
        "Go"
      ],
      "badges": [],
      "sessions": {
        "2016": [
          {
            "title": "Instant loading and great User Experience with PWA & AMP",
            "description": "Jumia Travel is the travel division of Jumia group, the African largest e-commerce website. As the African market is characterised by slow networks, performance has been one of the main priority of Jumia Travel to improve conversion. By combining Polymer and PWA technologies, Jumia Travel has been able to reduce the Avg. page load time of 60% on slow networks, reduce data usage by 30% and deliver an app-like experience to their users. Jumia Travel also managed to lower the first page load time, typical pain point of Progressive Web Apps, by using AMP landing pages that asynchronously side-load the PWA.",
            "tags": [
              "Web"
            ],
            "videoId": "8cyq1O4bz84"
          }
        ]
      },
      "socials": [
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": "https://www.linkedin.com/in/jos%C3%A9-santos-a9752240"
        }
      ]
    },
    "nelson_sachse": {
      "id": "nelson_sachse",
      "name": "Nelson Sachse",
      "country": "Porto, Portugal",
      "photoUrl": "/images/people/nelson_sachse.jpg",
      "title": "Android Lead",
      "company": "Sainsbury's",
      "shortBio": "Nelson is a technologist that created digital solutions – with special focus in the Android ecosystem – for well establish brands as Universal, Societe Generale, Swisscom.",
      "bio": "Nelson is a technologist that created digital solutions – with special focus in the Android ecosystem – for well establish brands as Universal, Societe Generale, Swisscom. He also presented for Denmark internet week last year, lead a workshop in the London South Bank University and co-created a series of events around edTech called tEchDU. www.techdu.org",
      "tags": [
        "Android",
        "Firebase",
        "Testing"
      ],
      "badges": [],
      "sessions": {
        "2016": [
          {
            "title": "Ustwo's Android strategy for CI and Firebase testing.",
            "description": "Use continuous integration in your Android project to apply tests in physical devices with one single commit.",
            "tags": [
              "Android",
              "Firebase",
              "Testing"
            ],
            "videoId": "Hp_kyKncPTI"
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": "https://twitter.com/SachseInTheCity"
        }
      ]
    },
    "ricardo_loureiro": {
      "id": "ricardo_loureiro",
      "name": "Ricardo Loureiro",
      "country": "Coimbra, Portugal",
      "photoUrl": "/images/people/ricardo_loureiro.jpg",
      "company": "WIT Software",
      "companyLogo": "/images/logos/wit.png",
      "title": "Quality Manager",
      "shortBio": "Ricardo plays the Quality Manager role at Wit.",
      "bio": "Ricardo plays the Quality Manager role at Wit. He has a vast experience in Quality Assurance, specially Test Automation, and he also was responsible for CMMI appraisal at WIT Software. He has too many hobbies to list but classic cars is on the top of the list.",
      "tags": [
        "Cloud",
        "Google Cloud Platform",
        "Quality Assurance",
        "Agile Development"
      ],
      "badges": [],
      "sessions": {
        "2016": [
          {
            "title": "Elastic Deployment",
            "description": "Or how to use Google Cloud Platform for peace of mind",
            "videoId": "rynMCVOy1t0"
          }
        ]
      },
      "socials": [
        {
          "icon": "gplus",
          "name": "Google+",
          "link": "https://plus.google.com/+RJLouro"
        }
      ]
    },
    "andre_maia": {
      "id": "andre_maia",
      "name": "André Maia",
      "country": "Porto, Portugal",
      "photoUrl": "/images/people/andre_maia.jpg",
      "title": "Product Owner",
      "shortBio": "André Maia is Product Owner at Jumia Travel, the leading travelling company in Africa. He has more than 15 years of experience on IT. He loves working on Agile environments. His main objective is to build amazing products and work with great people!",
      "bio": "André Maia is Product Owner at Jumia Travel, the leading travelling company in Africa. He has more than 15 years of experience on IT. He loves working on Agile environments. His main objective is to build amazing products and work with great people!",
      "tags": [
        "Progressive Web Apps",
        "Polymer",
        "AMP"
      ],
      "badges": [],
      "sessions": {
        "2016": [
          {
            "title": "Instant loading and great User Experience with PWA & AMP",
            "description": "Jumia Travel is the travel division of Jumia group, the African largest e-commerce website. As the African market is characterised by slow networks, performance has been one of the main priority of Jumia Travel to improve conversion. By combining Polymer and PWA technologies, Jumia Travel has been able to reduce the Avg. page load time of 60% on slow networks, reduce data usage by 30% and deliver an app-like experience to their users. Jumia Travel also managed to lower the first page load time, typical pain point of Progressive Web Apps, by using AMP landing pages that asynchronously side-load the PWA.",
            "tags": [
              "Web"
            ],
            "videoId": "8cyq1O4bz84"
          }
        ]
      },
      "socials": []
    },
    "diogo_junior": {
      "id": "diogo_junior",
      "name": "Diogo Júnior",
      "country": "Porto, Portugal",
      "photoUrl": "/images/people/diogo_junior.jpg",
      "company": "Critical TechWorks",
      "title": "Android Engineer",
      "shortBio": "Diogo is an engineer from FEUP that started working at Fraunhofer Portugal as scientist where he coordinated/managed/developed some national and european projects and oriented also some students during their thesis.",
      "bio": "So, \"basically\" and \"mainly\" I'm an engineer from FEUP that started working at Fraunhofer Portugal as scientist where I coordinated/managed/developed some national and european projects and oriented also some students during their thesis. Then I left the \"science\" world and joined an international e-commerce company(Porto Tech Center) that is supported by the German giant Rocket Internet. During one year I helped the tech team evolving the used technologies/coding standards/ platforms/services, etc related with the Android app Kaymu https://play.google.com/store/apps/details?id=com.kaymumarket.android Then I was looking for new challenges and new and more responsibilities and I joined 7graus where I'm currently the unique Lead Android - Full Stack Dev - ASO Expert.",
      "tags": [
        "Android",
        "Firebase",
        "Fabric",
        "Appfolow"
      ],
      "badges": [],
      "sessions": {
        "2016": [
          {
            "title": "ASO - App Store Optimization",
            "description": "You just published unintentionally an app that has a button that after clicked transfer 5 Euros from your account to the user's bank account on the app/play store. Do you need to worry?! Noooooo! No one will find it! :) This talk will explain what is ASO and how can it be optimized, as well as the tools and platforms to use.",
            "videoId": "156reuHfADQ"
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "name": "Twitter",
          "link": "https://twitter.com/drjunior"
        }
      ]
    },
    "vasco_santos": {
      "id": "vasco_santos",
      "name": "Vasco Santos",
      "country": "Porto, Portugal",
      "photoUrl": "/images/people/vasco_santos.jpg",
      "company": "Mindera",
      "companyLogo": "/images/logos/mindera.png",
      "title": "Java Sourcerer",
      "shortBio": "Vasco is a Java developer at Mindera, changing a monolith architecture into a micro service architecture.",
      "bio": "Vasco is a Java developer at Mindera, changing a monolith architecture into a micro service architecture. He's still under the radar for the community, but well known in the projects that he works for, always mentoring and promoting best practices, whether it's code related or just related with the big picture. Previously he worked in Lisbon as an expendable resource in some obscure companies.",
      "tags": [
        "Cloud",
        "Java",
        "Scala",
        "Docker",
        "Kubernetes"
      ],
      "badges": [],
      "sessions": {
        "2016": [
          {
            "title": "Stuff that eases microservices development and what not",
            "description": "Are you taking the appropriate steps to ease the development and other stuff such as integration, discovery, management, support on your micro service architecture approach? As more and more micro services you build, the flaws in the architecture become increasingly apparent. Are you using service discovery? Do you control your load balancers? Does configuration changes require a new deploy of the service? If not it's probably about time you start doing these. In here you will be shown how to start applying these concepts in practice to simplify a lot of your work.",
            "videoId": "b8y3dp9uHNE"
          }
        ]
      },
      "socials": [
        {
          "icon": "github",
          "name": "GitHub",
          "link": "https://github.com/jvosantos"
        },
        {
          "icon": "linkedin",
          "name": "LinkedIn",
          "link": "https://linkedin.com/in/jvosantos"
        }
      ]
    },
    "panayotis_tzinis": {
      "id": "panayotis_tzinis",
      "name": "Panayotis Tzinis",
      "title": "GDE, Design",
      "company": "X-Lab",
      "photoUrl": "/images/people/panayotis_tzinis.jpg",
      "bio": "Panayotis (AKA Darth), is the Intelligence Tech Lead of the X | Lab. The X Lab is a tech tank based  on the planet of Mustafar, where crazy people, from scientists to artists, to developers to technologists, share their ideas in order to create moonshots! A moonshot is a radical solution, integrating breakthrough technology with native thinking. More than on projects we are exploring ambitions! Darth is also a Google Developer Expert on Product Design, and a GDE on Google Pay focusing on AI and Human Interface behaviour and a Google Sprint Master.",
      "sessions": {
        "2019": [
          {
            "title": "Designing in the Age of Machines",
            "description": "We will have an intro on designing and researching on-device machine learning product and what it means in practice to take a human-centered approach to designing an AI-powered product + a few takeovers"
          },
          {
            "title": "Designing for wicked problems",
            "workshop": true,
            "description": "Throughout, hopefully if time allows us, 3 Lab exercises we will intro \"wicked problems\", what are they, how to address them and how to \"try\" to solve them without creating others! That's wicked! At each Lab Exercise attendees will do some hands-on design/sketching, discussion and ideation."
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "link": "https://twitter.com/ptzinis",
          "name": "Twitter"
        }
      ]
    },
    "sara_vieira": {
      "id": "sara_vieira",
      "name": "Sara Viera",
      "title": "GraphQL",
      "company": "YLD",
      "photoUrl": "/images/people/Sara_Vieira.png",
      "bio": "Developer Advocate at @YLDio. GraphQL and Open Source enthusiast. Conference Speaker and Airport expert. I am also into drums and horror movies.",
      "sessions": {
        "2019": [
          {
            "title": "I have 99 problems but GraphQL is not one!",
            "description": "You have probably heard about GraphQL and probably heard people say it’s amazing but never understood why you should learn yet another thing. In this talk we will go over just why everyone seems to love this new kid on the block, how to get started with it and debunk some myths about GraphQL. The objective is that you leave this talk as excited as me about GraphQL.",
            "videoId": "Sn7u1EpLdwg"
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "link": "https://twitter.com/NikkitaFTW",
          "name": "Twitter"
        }
      ]
    },
    "sam_bellen": {
      "id": "sam_bellen",
      "name": "Sam Bellen",
      "title": "GDE, Security",
      "company": "Auth0",
      "photoUrl": "/images/people/Sam_Bellen.png",
      "bio": "Sam Bellen is a Google Developer Expert who works as a Developer Evangelist at Auth0. At Auth0 we’re trying to make authentication and identification as easy as possible, while still keeping it secure. After office hours he likes to play around with the web-audio API, and other “exotic” browser API’s. One of his side projects is a library to add audio effects to an audio input using JavaScript.  When he's not behind a computer, you can find him playing the guitar, having a beer at a concert, or trying to snap the next perfect picture.",
      "sessions": {
        "2019": [
          {
            "title": "Passwords are so 1990",
            "description": "As long as we’ve been using the internet, and way before that, we have been authenticating through some sort of username and password combination. It has become the standard. With the ever increasing number of web-apps, we’re seeing more and more data breaches as well. What if we could build our authentication processes in a way the user doesn’t need a password? In this talk I will give a quick overview of the past, present and future of authentication. From basic authentication to passwordless biometric authentication using the web authentication API, and everything in between. The audience does not need any specific knowledge as this talk will not go into implementation details, but aims to give a view of what’s to come in terms of authentication.",
            "videoId": "PEgqE8MvSEU"
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "link": "https://twitter.com/sambego",
          "name": "Twitter"
        }
      ]
    },
    "ines_santos_silva": {
      "id": "ines_santos_silva",
      "name": "Inês Santos Silva",
      "title": "PWIT",
      "company": "Portuguese Women in Tech",
      "photoUrl": "/images/people/Ines_Santos.jpg",
      "bio": "Inês Silva is a co-founder at Portuguese Women in Tech and a Managing Partner at Aliados, an impact driven consulting firm working with public and private organisations to solve some of their biggest social and environmental challenges.",
      "sessions": {
        "2019": [
          {
            "title": "Opening keynote",
            "description": "Opening Keynote by Inês Santos Silva"
          }
        ]
      },
      "socials": [
        {
          "icon": "linkedin",
          "link": "https://www.linkedin.com/in/inessantossilva",
          "name": "Linkedin"
        }
      ]
    },
    "isabel_costa": {
      "id": "isabel_costa",
      "name": "Isabel Costa",
      "title": "Open Source, Android",
      "company": "Grupo Imprensa",
      "photoUrl": "/images/people/Isabel_Costa.png",
      "bio": "Isabel is a Software Developer at Grupo Impresa. She got into Open Source through Google Summer of Code (GSoC) program in 2018. During her time as a GSoC student, she started a project with Systers Open Source community, using python for the backend and Kotlin for the Android application. She started as a student and now is one of the maintainers of the project, using it to help beginners at Open Source do their first contributions.",
      "sessions": {
        "2019": [
          {
            "title": "Doing Open Source as a contributor and a maintainer",
            "description": "When I was accepted into Google Summer of Code program, I was a total beginner at Open Source. I did some very small contributions but was still very intimidated by Open Source. I started the program as a student working on the project I proposed with the help of my mentors and community and after it ended I became a maintainer. As a contributor, I had to work on projects I didn’t know much as a maintainer I had to make sure the project was ready and friendly to outside contributors. In this talk, I want to share my learnings and perspective from working in Open Source being in both sides, while sharing some tips on how to start contributing to a new project and keeping a project beginner friendly."
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "link": "https://twitter.com/isabelcmdcosta",
          "name": "Twitter"
        }
      ]
    },
    "filipe_filipe_barros": {
      "id": "filipe_barroso",
      "name": "Filipe Barroso",
      "title": "Flutter, Tensorflow",
      "company": "GDG Lisboa",
      "photoUrl": "/images/people/filipe_barroso.jpeg",
      "bio": "Filipe Barroso, is a Software Engineer that loves getting out of his zone of comfort, if you don't see him at a tech event, he is probably organizing the next tech event by Google Developer Group Lisbon, reading about psychology or preparing the next bit of Standup comedy.  As a developer, He worked in android applications for Portugal Telecom now known as Altice, Brisa, Federação Portuguesa Futebol, TAP, Bayer among many others and currently he is working remotely as an Android Developer and Machine Learning Engineer.",
      "sessions": {
        "2019": [
          {
            "title": "What the Flutter?",
            "description": "Flutter, the new Open Source mobile application SDK to create native applications in one codebase. What is Flutter and why should you care about it? At the end of the talk, you will understand the decisions behind Flutter, why it is so different from others mobile development tools and platforms and why is so many developers already addicted to it. I will also showcase how to build a small working app and how structure a project."
          },
          {
            "title": "Flutter Kickoff",
            "workshop": true,
            "description": "Come in with a basic knowledge of what is get out with a working app on your smartphone.<br>This workshop is for curious and beginners with Flutter, we will be building an app from scratch while experimenting with various views.<br>Please bring your own laptop with Flutter install, follow this link for so: https://flutter.io/docs/get-started/install<br>Also have installed:<br>- Visual Studio Code ( with Flutter and Dart Plugins Installed)<br>- Git"
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "link": "https://twitter.com/ABarroso",
          "name": "Twitter"
        }
      ]
    },
    "carlos_mota": {
      "id": "carlos_mota",
      "name": "Carlos Mota",
      "title": "Android, Kotlin",
      "company": "WIT Software",
      "companyLogo": "/images/logos/wit.png",
      "photoUrl": "/images/people/carlos_mota.jpeg",
      "bio": "Hello human, I'm a strong believer that... HAL didn't do anything to harm Dave, he(?) was truly preoccupied with his friend safety. Also the answer to life, the universe and everything seems to (still) be 42.  At night I'm fighting crime... oh wait; wrong bio here. Here it goes the uncensensored version: for several years now, I've been developing mobile applications. First on the energy consumption field, then Telco and, in the middle, of it I've found the time to create a game with some friends - Word Dare - it was fun! I'm currently working at WIT Software on the company RCSe applications - first for iOS and now on Android.  From time to time, I like to make long monologues and wait for the entire audience to fall asleep - lets call them \"talks\". I've been giving a few for University of Coimbra, WIT Software, DevFest, Pixels Camp, mdevcon, etc.",
      "sessions": {
        "2015": [
          {
            "title": "Android TV Strangelove",
            "description": "The concept of a single device has been depreciated for years now. We have a smartphone on our pockets, a smartwatch on our wrists, a laptop on our desks, a tablet on our backpacks, a TV on our living rooms, etc. and although we have this diversity of devices, only recently they learn about the existence of each other and started to interact.\nIdeas like receiving a call on our phones and answer it instead on the computer or using our devices as remote controls for a TV game are now possible.\nOver the last years, our televisions have been losing our attention. They became difficult to use - we no longer have a small number of channels or 9 to 5 schedules which allowed us to watch a specific movie at a defined time - for example, we want to watch a movie after a long day at work without pressing dozens of buttons and without watching through long commercials.\nWe want the same experience that we have on our computers or tablets. Manufacturers have been attempting to solve this problem by filling our TV’s with a large amount of applications that we might have opened once to see how they work - and well… they are still there… somewhere. From the last two Google I/O's, Google has been focused on releasing what they believe to be next TV experience - Android TV. Their proposal is an android set top box along with a new support library - leanback - as well as a defined set of designing rules which will allow the user to take the best experience from their TV’s. Moreover, you can use your mobile phone as a secondary device/or remote control increasing the number of features available and providing new ways to interact with your TV. On this talk I’m planning to give an overview of what is possible to do with this new system along with some code samples - what to do, why to do it and how you can do it, examples and pitfalls to avoid.",
            "presentation": "https://drive.google.com/open?id=0B-c8KPK0BrRGWi1RTTQyUkYyM0k"
          }
        ],
        "2018": [
          {
            "title": "Kotlin my way in",
            "description": "Developers, developers, developers. I’ve always thought that it is amazing what we do - we never settle, we always try to figure out new things, test new things and improve the ones on which we work daily; whether it’s a newly found library, a new architecture pattern that suddenly started to be trending or in this particular case a new language called Kotlin - rejoice! However those things have different impacts on our projects - using a new library has a different risk than adopting a new language and this is where things get… or as you will hear got really complicated. For the past years I’ve been trying to evangelise - wololooo - [read this with Age Of Empires priests voice] the people at my company and community into taking the step of gradually start using Kotlin on our applications. And it hasn’t been an easy task. First, not everyone shares the same enthusiasm in learning something new and secondly making the shift of leaving a language which they know and are familiar with to a new one requires time (both for companies and for people). Fast forward to the present and currently we have Kotlin code in production, a team thrilled with learning new things and managers glad that all deadlines have been successfully accomplished.",
            "tags": [
              "Kotlin",
              "Android"
            ],
            "videoId": "TvoDRnwMGYQ"
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "link": "https://twitter.com/cafonsomota",
          "name": "Twitter"
        }
      ]
    },
    "danliel_mallcott": {
      "id": "danliel_mallcott",
      "name": "Daniel Mallcott",
      "title": "",
      "company": "TransferWise",
      "photoUrl": "/images/people/Daniel_Mallcott.jpg",
      "bio": "Daniel is an android engineer at TransferWise, coming all the way from Venezuela to build a career in the tech world. Today he’s working alongside fourteen other android nerds towards causing a positive impact in fintech, one user at a time. He likes taking long walks down the beach, fighting for diversity and building beautiful products. If you see him around say hi, his favourite hobby is making friends.",
      "sessions": {
        "2019": [
          {
            "title": "How well do you know your user?",
            "description": "One of my favourite things about building products is that we have the opportunity to improve others lives. Event if just a tiny bit. The thing is, do you really know who you’re helping?<br>Until recently, users where an abstract concept in my head. The user. After learning how to use Firebase, Google Analytics and other tools, I’ve learned how to turn that abstract into real. A user into a person.<br>In this talk we will explore how we use analytic streams to paint a picture of what our average user looks like. I’ll share some tips we’ve picked up over the years and how thinking in terms of people can level up your product."
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "link": "https://twitter.com/danielmallcott",
          "name": "Twitter"
        }
      ]
    },
    "joao_reis": {
      "id": "joao_reis",
      "name": "João Reis",
      "title": "Android",
      "company": "ebankIt",
      "photoUrl": "/images/people/Joao_Reis.jpg",
      "bio": "João Reis has been developing Android applications since 2014 and is currently a Senior Android Developer at eBankIT. A Kotlin enthusiast and passionate about software architecture he has worked in projects from hospitality applications to Telco and currently Fintech. João is also a music lover and metalhead by heart he never misses a chance to catch a concert",
      "sessions": {
        "2019": [
          {
            "title": "Clean Architecture and white label - a case study",
            "description": "Building white label apps can be a daunting task, especially because requirements and design will most likely change from client to client. At eBankIT we address this challenge by taking yet another approach to the good old clean architecture.<br>This talk will dive into the concepts of Clean Architecture applied to Android with a modular and semi-functional approach by leveraging the features of the Kotlin language and Kotlin co-routines.",
            "videoId": "Tb_6Lav_msk"
          }
        ]
      }
    },
    "joao_teixeira": {
      "id": "joao_teixeira",
      "name": "João Teixeira",
      "title": "Design",
      "company": "WIT Software",
      "photoUrl": "/images/people/Joao_Teixeira.png",
      "bio": "Design Manager at WIT Software. Digital design nerd, UX tinkerer, Product Design addict, 3D junkie and code monkey wannabe. Into obscure pop culture references, hygge and early Schwarzenegger movies.",
      "sessions": {
        "2019": [
          {
            "title": "Designers want to destroy the world",
            "description": "In a world full of guidelines, established processes, automation and over-speccing, are we forgetting about individuality and the real human beings that use our products?<br>Let’s have an open minded conversation about the bigger picture of digital product creation from a designer’s perspective and learn how we can all take a step back to change our points of view in order to make our products better for the people that really matter: our users.",
            "videoId": "zTHPnzuqfc8"
          }
        ]
      }
    },
    "alex_barlow": {
      "id": "alex_barlow",
      "name": "Alex Barlow",
      "title": "Microservices",
      "company": "Echo",
      "photoUrl": "/images/people/alex_barlow.jpg",
      "bio": "Principle Engineer for Echo, an online pharmacy sending thousands of patients their medications daily. Interested in service architecture and problems at scale",
      "sessions": {
        "2019": [
          {
            "title": "Changing the wheels on a moving bus. Microservices in the real world.",
            "description": "Many talks are about the concepts of (micro) services and systems, either the benefits of how they are amazing (Netflix!), or how they're terrible (Rails). But few talks peel back the surface to talk about the day to day work of SOA in a small team and show concrete examples and working, live systems, what's hard about the them and the problems you overcome and what's great and include real details about the system.<br>In this talk, I'll be describing big issues we've had and the complexities of moving from what was basically a \"prototype\" startup written on Firebase, to a system with over 30 services shipping 1000s of packages a day. A migration that happened (mostly) without anyone noticing.<br>In particular, a brief overview of areas at Echo on Go / gRPC / Typescript / GraphQL (an entirely typed stack) and monitoring along with details of actual system designs."
          }
        ]
      },
      "socials": [
        {
          "icon": "twitter",
          "link": "https://twitter.com/alexrbarlow",
          "name": "Twitter"
        }
      ]
    },
    "pedro_machado": {
      "id": "pedro_machado",
      "name": "Pedro Machado",
      "title": "Android",
      "company": "XING",
      "photoUrl": "/images/people/Pedro_Machado.jpg",
      "bio": "Pedro is a Software Engineer currently working on XING's Android app. He loves tearing stuff apart, just to put it back together again (this includes, but is not limited to the modularisation of Android projects). He has built solutions across the whole Android ecosystem, be it phones, watches, TVs, cars or even smart assistants. He's still waiting for the opportunity to create something for smart toasters or microwaves. It will eventually come along.",
      "sessions": {
        "2019": [
          {
            "title": "Modularisation: what could go wrong?",
            "description": "Android projects can be difficult to maintain, especially when the team is fairly big or when there's little to no upfront planning. Complexity will increase and, if not cared for, so will technical debt and compilation times. Though having separate modules might seem like the obvious approach when starting a project, that's not how it always plays out, therefore modularisation may be a nearing challenge for an increasing number of projects. Modularisation is not without some complicated challenges that will make you question is usefulness. In this talk we'll document our initial approach to modularising XING's Android project, the challenges we faced and what we hope to achieve. Hopefully it will help you think about what your project needs and motivate you into solving some of the problems you might be facing everyday.",
            "videoId": "GmKmE0tVSis"
          }
        ]
      },
      "socials": [
        {
          "icon": "xing",
          "link": "https://www.xing.com/profile/Pedro_Machado10",
          "name": "Xing"
        }
      ]
    },
    "mostafa_hanafy": {
      "id": "mostafa_hanafy",
      "name": "Mostafa Hanafy",
      "title": "Android",
      "company": "XING",
      "photoUrl": "/images/people/Hanafy.jpg",
      "bio": "Mostafa is a Software Engineer working on the Android app for XING. He is passionate about developing software for limited resources devices. He likes to keep the code always clean in a way that makes him panic when he sees legacy code, but also beleives that a little bit of legacy code won't hurt till next chance to refactor it.",
      "sessions": {
        "2019": [
          {
            "title": "Modularisation: what could go wrong?",
            "description": "Android projects can be difficult to maintain, especially when the team is fairly big or when there's little to no upfront planning. Complexity will increase and, if not cared for, so will technical debt and compilation times. Though having separate modules might seem like the obvious approach when starting a project, that's not how it always plays out, therefore modularisation may be a nearing challenge for an increasing number of projects. Modularisation is not without some complicated challenges that will make you question is usefulness. In this talk we'll document our initial approach to modularising XING's Android project, the challenges we faced and what we hope to achieve. Hopefully it will help you think about what your project needs and motivate you into solving some of the problems you might be facing everyday.",
            "videoId": "GmKmE0tVSis"
          }
        ]
      },
      "socials": [
        {
          "icon": "xing",
          "link": "https://www.xing.com/profile/Mostafa_Hanafy",
          "name": "XING"
        }
      ]
    },
    "rui_mendes": {
      "id": "rui_mendes",
      "name": "Rui Mendes",
      "title": "Android",
      "company": "Hostelworld",
      "photoUrl": "/images/people/Rui_Mendes.jpg",
      "bio": "5 years working with the Android platform and a tech enthusiast.<br>Most of his time is spent between beer, sports (mainly watching sports, not really practicing!) and a computer, with no particular order.<br><br>Likes to think he is a funny guy, but no one else seems to agree with him.",
      "sessions": {
        "2019": [
          {
            "title": "Actions for Google Assistant: How easily can you build your own assistant?",
            "description": "Have you ever wondered how you could build your own Assistant?<br>In this talk I will guide you on the process of creating a simple assistant.<br>DialogFlow will be our NLP (Natural Language Processor), Firebase Cloud Functions will be used to process the commands and you will even see how you could integrate it with your own Android App.<br>Exciting stuff!",
            "videoId": "81YEf0vbxns"
          }
        ]
      },
      "socials": [
        {
          "icon": "github",
          "link": "https://github.com/ruimendesM",
          "name": "Github"
        }
      ]
    },
    "jose_silva": {
      "id": "jose_silva",
      "name": "José Silva",
      "title": "Angular, Web",
      "company": "Critical Manufacturing",
      "photoUrl": "/images/people/Jose.jpg",
      "bio": "Web enthusiast, with the mission of bringing enterprise applications up to speed with Web Standards. José has been developing enterprise web applications with Angular (+2) since 2015 and is an avid “code once, use it everywhere” advocate.<br>José also volunteers as IEEE Portugal Chairman, supporting an amazing team of Engineers throughout the country, actively contributing to IEEE standards. On his free time, he plays the Tuba on some local groups and ensembles in north Portugal.",
      "sessions": {
        "2015": [
          {
            "title": "Angular 2 - Building Enterprise Apps",
            "description": "In a rapidly changing environment as is the Web, developing enterprise applications, destined to be in production for decades, is a serious undertaking. Choosing the right framework to work with can have the same impact as choosing the person you will be marrying: have you thought that it may be easier to change spouses than replacing an entire enterprise system?</p><p>At Critical Manufacturing we are building the next generation of our flagship product cmNavigo for the web and mobile devices. Using Angular 2, Typescript and Flux at its core, the new cmNavigo interface is designed to be used 24/7 by thousands of users every day in cross-platform and different size form devices across the world.</p><p>In this talk I will share the latest development challenges we are facing and how we are modeling the system to have the performance and stability our customers demand. We will explore how Angular 2 latest alphas are helping us moving in the right direction, embracing new standards and how we are managing our development environments to increase productivity.",
            "videoId": "r-pUWh1Y_FI"
          }
        ],
        "2019": [
          {
            "title": "Angular  -  Building Enterprise Applications (Still)",
            "description": "In 2015, when Angular 2 was launched, I made a presentation on this very event talking about all the reasons why you should pick Angular 2 as your Web Development framework. Now, more than 2 years later, I bring to you why should still pick Angular as your go to framework for web and desktop applications.<br>In Critical Manufacturing we started our MES product journey in HTML5 right with Angular from the very beginning. We  soon realized that we could do much more than just a Single Page Application. We turned Angular into the foundation of every frontend we do, from the product UI itself, to it’s documentation and even its installer.<br><br>Enter this journey with us and discover what Angular can do for you!",
            "videoId": "5WOhCy-jEY0"
          }
        ]
      },
      "socials": [
        {
          "icon": "linkedin",
          "link": "https://www.linkedin.com/in/jpsfs/?locale=en_US",
          "name": "Linkedin"
        }
      ]
    },
    "victor_sanchez": {
      "id": "victor_sanchez",
      "name": "Víctor Sanchéz",
      "company": "MashMeTV",
      "photoUrl": "/images/people/victor_sanchez.jpg",
      "bio": "Víctor is a developer, lecturer and entrepreneur. He runs his own company called MashMeTV that provides video collaboration applications to more than 800,000 users in 71 countries.</p><p>His new obsession is HTML5 and client-side applications. For the last couple of years, Víctor has been organizing tech events and conferences for kids and adults at places like HTML5 vs Android, Hack4Good Spain, HTML5Party, Iniciador Kids and others – in order to extend computer science and STEM.</p><p>Recently appointed Google Developer Expert in HTML5.",
      "sessions": {
        "2015": [
          {
            "title": "WebComponentes, Polymer and the new web",
            "description": "During this talk Google Developer Expert Víctor Sánchez will talk about web components, and an amazing library to build on them, Polymer.</p><p>With its brand new version Polymer 1.0 will be able to put back engineering into the web platform at blazing speed.</p><p>As we see it web components are the building blocks of the future. Do you want a ride?",
            "videoId": "IjrWbYdiENk",
            "presentation": "https://drive.google.com/open?id=0B-c8KPK0BrRGNjBFam1ycXY3aG8"
          }
        ]
      },
      "badges": [
        {
          "name": "GDE",
          "description": "Google Developer Expert",
          "link": "https://developers.google.com/experts/people/"
        }
      ],
      "socials": [
        {
          "icon": "twitter",
          "link": "https://twitter.com/VictorSanchez",
          "name": "Twitter"
        }
      ]
    },
    "sofia_rodrigues": {
      "id": "sofia_rodrigues",
      "name": "Sofia Rodrigues",
      "company": "i2S",
      "companyLogo": "/images/logos/i2s.png",
      "photoUrl": "/images/people/sofia_fabio.jpg",
      "bio": "Sofia is an Usability and UX expert. In 2004 she began working in the media and design for dFUSION, an advertising agency, working in design, web application development, marketing, among others.</p><p>In 2009 she had the opportunity to start collaborating with i2S, specializing in myGIS portal interface, in the last to years she has launched the UX area for i2S.</p><p>Completely crazy, says many bad words, colleagues like to say ''Bom dia, Sofia'' regardless of time of day, is treated as ''one of the guys'' and is said to be pregnant for more than three years!",
      "sessions": {
        "2015": [
          {
            "title": "Cardboard, a user's perspective",
            "description": "Think about a very good restaurant... Have you seen the kitchen? No? Probably is a huge mess. But will this fact change your dinner experience? Maybe not if it all works fine.</p><p>As customers we won't go to the restaurant thinking about the kitchen but for the food, the nice environment, the friendliness of the staff , among other variables.</p><p>In the end, all of these variables make you have (or not) a good dinner experience. This is what happens with any product or service and it's called User eXperience.</p><p>The Google Cardboard is a good example where you can have an awesome user eXperience of virtual reality while only spending 5 euros and owning a smartphone.</p><p>Why not take it for a spin?",
            "videoId": "reahAICvChw",
            "presentation": "https://drive.google.com/open?id=0B-c8KPK0BrRGZTd5cTVDc2FzRGc"
          }
        ]
      },"socials": [
        {
          "icon": "linkedin",
          "link": "https://linkedin.com/in/sofiaalves",
          "name": "Linkedin"
        },
        {
          "icon": "twitter",
          "link": "https://twitter.com/sofiafilalves",
          "name": "Twitter"
        }
      ]
    },
    "fabio_alves": {
      "id": "fabio_alves",
      "name": "Fabio Alves",
      "company": "i2S",
      "companyLogo": "/images/logos/i2s.png",
      "photoUrl": "/images/people/sofia_fabio.jpg",
      "bio": "Fábio is a frontend specialist and is reading for his Masters in Architecture, Systems and Networks. In 2011 he started the collaboration with i2S, usability team where he exudes AngularJS every day.</p><p>He aims to finish his thesis before retirement. Do not talk to him before 10 am, or call him to congratulate him on his birthday before 4PM. There is a  rumor that his ''boss'' hits him and recently hired a karate specialist to help her!",
      "sessions": {
        "2015": [
          {
            "title": "Cardboard, a user's perspective",
            "description": "Think about a very good restaurant... Have you seen the kitchen? No? Probably is a huge mess. But will this fact change your dinner experience? Maybe not if it all works fine.</p><p>As customers we won't go to the restaurant thinking about the kitchen but for the food, the nice environment, the friendliness of the staff , among other variables.</p><p>In the end, all of these variables make you have (or not) a good dinner experience. This is what happens with any product or service and it's called User eXperience.</p><p>The Google Cardboard is a good example where you can have an awesome user eXperience of virtual reality while only spending 5 euros and owning a smartphone.</p><p>Why not take it for a spin?",
            "videoId": "reahAICvChw",
            "presentation": "https://drive.google.com/open?id=0B-c8KPK0BrRGZTd5cTVDc2FzRGc"
          }
        ]
      },"socials": [
        {
          "icon": "linkedin",
          "link": "https://pt.linkedin.com/pub/fábio-alves/98/a19/a8b",
          "name": "Linkedin"
        }
      ]
    },
    "miriam_lopes": {
      "id": "miriam_lopes",
      "name": "Miriam Lopes",
      "company": "WIT Software",
      "companyLogo": "/images/logos/wit.png",
      "photoUrl": "/images/people/miriam_lopes.jpg",
      "bio": "Miriam once dreamed about becoming a well-known writer. Well... that didn't worked out.</p><p>Now, she is a QA Engineer at WIT Software and the things she writes are test plans, test automation scripts and test reports. She has been testing over the past few years, manually and automatically, several Android applications that are used by millions of people worldwide.</p><p>As a part of WIT Software, she believes that good is not enough and that is why the pursuit for excellence is the every day challenge. Breaking applications can be fun, but the main goal is to deliver software that is compliant with WIT high quality standards.",
      "sessions": {
        "2015": [
          {
            "title": "Break it. To make it.",
            "description": "Testers vs Developers - should they fight to the death, or hug it out?</p><p>Software Quality Assurance area has been growing over the past few years. It's becoming more common each day to have testing teams working along with developers with the common goal of delivering software good enough to make them proud. In fact these two old enemies have become more close each day and this interaction has been proved decisive when it comes to software quality. But not everything is a fairy tale with a happy ending. Specially when it comes to mobile testing there are many challenges to overcome. Software complexity is increasing and the market is becoming more demanding. We want to do better and faster and cheaper. How to achieve that? For many organizations Automation is the answer. Want it faster? Automate. Want it cheaper? Automate. And then, you will have better. Is this the magical formula?</p><p>On this talk I will cover this topics, do some demonstrations and give some useful tips that developers can use to help testers on their QA quest.</p><p>Cause sometimes... the best way to make it, is to break it first.",
            "videoId": "x9Cn9W7sgVw",
            "presentation":  "https://drive.google.com/open?id=19GhL4b7gkZM6M8-9nE7kPKtsKSsCqd-tEOqkb4qqvHg"
          }
        ]
      },
      "socials": [
        {
          "icon": "linkedin",
          "link": "https://linkedin.com/in/miriamlopes",
          "name": "Linkedin"
        }
      ]
    },
    "sergio_rodrigues": {
      "id": "sergio_rodrigues",
      "name": "Sérgio Rodrigues",
      "company": "Sage Portugal",
      "photoUrl": "/images/people/sergio_rodrigues.jpg",
      "bio": "He is and Engineer and Entrepreneur who has been, for most of his life, developing new products, finding new ways of using cutting edge technology to achieve the simplest goals.</p><p>He started working during University, and by 1996, his first real job was developing electronics on a huge hardware company. By 2000 he was CTO – Chief Technology Officer – of a leading hospitality software company.</p><p>In 2006 he started his first company and by now he has co-founded and sold a number of software technology companies. He has lived and done business in London, Hong Kong and Singapore but, currently, besides being product manager at Sage he is also Mentor at UPTEC and Business Angel</p><p>Like many serial entrepreneurs, he has many things going on at once.",
      "sessions": {
        "2015": [
          {
            "title": "NDK: Native Android POS app, multiplatform porting",
            "description": "Sage Software has a vast experience on Point of Sale software and, it's going multiplatform.</p><p>Looking at the POS terminals market, it's clear the future of this kind of hardware is Android so, after Windows and Linux, the time has come for this platform.</p><p>One year ago, a project was started to port an existing C++ software for Android and this is it story:</p><p>- The NDK tricks</p><p>- C++ compiler and Java wrapper interaction</p><p>- How to Debug native apps</p><p>- The SDL graphic library</p><p>- The Heartbleed problem</p><p>- The ARM and x86 architectures support</p><p>By now, the app is selling on the Play Store and sucessfully bringing traditional desktop customers to Android platform.",
            "videoId": "CK5hDk1a1gQ"
          }
        ]
      },
      "socials": [
        {}
      ]
    },
    "abreu_ibanez": {
      "id": "abreu_ibanez",
      "name": "Andreu Ibáñez",
      "company": "GDG Lleida",
      "photoUrl": "/images/people/andreu_ibanez.jpg",
      "bio": "Andreu Ibanez is a Google Expert, Google Developers Group Lleida Founder and lead organizer, Member of GDG Spain, Google Glass Explorer, Mentor admin and speaker Google Summer of Code, Founder Google Liquid Galaxy LAB, The Physical Web Google IoT proposal expert and speaker, Founder Lleida Drone, and Project Manager at Ponent 2002, a SMB located in Lleida, Spain, specialized in IT R+D+i projects.</p><p>Among many other projects Andreu is now working with Virtual and Augmented Reality tools from Google, being Project Tango tester and authorized speaker, and working on several Cardboard VR projects in education, tourism, cinema and marketing.",
      "sessions": {
        "2015": [
          {
            "title": "The Project Tango from Google, understanding the surroundings",
            "description": "Google's Project Tango incorporates advanced computer vision capacities for the Android platform, using real time image processing techniques and special sensors. With many possible applications, Project Tango will shine on motion tracking, 3D sensing, and depth perception applications that developers are started to work on.</p><p>The talk will explain about the system abilities, explore some use cases, and have a live demo on stage and screen.",
            "videoId": "PSeZU784A-M",
            "presentation": "https://docs.google.com/presentation/d/1khEmKc7vSAGWMhvpsokJcH8Xg-HKtIXW0vD659I1-1A/edit"
          }
        ]
      },
      "badges": [
        {
          "name": "GDG",
          "description": "Google Developer Group Lleida",
          "link": "https://developers.google.com/groups/chapter/107962088655881499591/"
        }
      ],
      "socials": [
        {
          "icon": "linkedin",
          "link": "https://es.linkedin.com/in/andreuibanez",
          "name": "Linkedin"
        },
        {
          "icon": "twitter",
          "link": "https://twitter.com/andreuibanez",
          "name": "Twitter"
        },
        {
          "icon": "website",
          "link": "http://www.andreuibanez.com/",
          "name": "Website"
        }
      ]
    },
    "juarez_filho": {
      "id": "juarez_filho",
      "name": "Juarez Filho",
      "company": "madewithlove",
      "photoUrl": "/images/people/juarez_filho.jpg",
      "bio": "Juarez Filho is an enthusiastic Front end Engineer with over 7 years of experience, started his career as backend developer, but with his first CSS class he devoted completely to Front End and UX.</p><p>Currently building things with love at @madewithlove and also a GDG Organizer spreading the awesome Google Technologies mainly Firebase and web related topics.",
      "sessions": {
        "2015": [
          {
            "title": "Firebase Adventures - How to create extraordinary apps with Firebase & AngularJS",
            "description": "Firebase is a powerful platform for building mobile and web applications. Use Firebase to store and sync data instantly, authenticate users, and easily deploy your web app.</p><p>Firebase Adventures is a talk about how to use Firebase in different ways, for DevFest Porto  we'll focus also in how you can combine Firebase & AngularJS using AngularFire, the Firebase's official binding for Angular.",
            "videoId": "-s5sXLJpDN8"
          }
        ]
      },
      "badges": [
        {
          "name": "GDG",
          "description": "Google Developer Group Maceió",
          "link": "https://developers.google.com/groups/chapter/105591078626334574818/"
        }
      ],
      "socials": [
        {
          "icon": "linkedin",
          "link": "https://es.linkedin.com/in/juarezpaf",
          "name": "Linkedin"
        },
        {
          "icon": "twitter",
          "link": "https://twitter.com/juarezpaf",
          "name": "Twitter"
        },
        {
          "icon": "github",
          "link": "https://github.com/juarezpaf",
          "name": "GitHub"
        }
      ]
    },
    "rui_carneiro": {
      "id": "rui_carneiro",
      "name": "Rui Carneiro",
      "company": "Blip",
      "photoUrl": "/images/people/rui_carneiro.jpg",
      "bio": "Rui obtained his masters in software engineering in 2009 but his love for Javascript started before that. He has always been passionate about web technologies and he is a member of the restricted group of developers that loves CSS.</p><p>He is a science enthusiast, a gamer geek and he has the unique ability of finding the weirdest things on the internet.",
      "sessions": {
        "2015": [
          {
            "title": "AngularJS: Building and maintaining a large scale application",
            "description": "At Blip we are currently rebuilding all our products and transforming them into single page apps. Application performance and fast releases are key points for the business.</p><p>In this talk I will share our current developing process, how do we handle weekly releases, how we manage to have more than 10 teams working on different projects sharing code and how AngularJs eases this process.",
            "videoId": "1QxcBF_EF4k",
            "presentation": "https://github.com/carneiror/gdgporto-2015"
          }
        ]
      },
      "socials": [
        {
          "icon": "linkedin",
          "link": "https://pt.linkedin.com/in/ruiarc",
          "name": "Linkedin"
        }
      ]
    }
  }
}
